steven87090799/InkTime/esp32/ink-display-7C-photo/ink-display-7C-photo.ino
static void setConfigPersistenceError(const String &persistError) {
  lastDeviceErrorCode = "DEVICE-CONFIG-PERSIST";
  lastDeviceErrorMessage = "遠端設定持久化失敗：";
  if (persistError.length() > 0U) {
    lastDeviceErrorMessage += persistError;
  } else {
    lastDeviceErrorMessage += "PAIRING-NVS-UNKNOWN";
  }
}

static int calculateSha256(const unsigned char* input, size_t length, unsigned char output[32]) {
#if MBEDTLS_VERSION_MAJOR >= 3
  return mbedtls_sha256(input, length, output, 0);
#else
  return mbedtls_sha256_ret(input, length, output, 0);
#endif
}

static bool backendTransportAllowed(const String &base, const String &ca_pem) {
  String errorCode;
  if (inktime::DeviceHttpTransport::backendUrlAllowed(base, ca_pem, errorCode)) return true;
  lastDeviceErrorCode = errorCode;
  lastDeviceErrorMessage = "Backend URL 或 TLS trust anchor 不符合安全政策";
  return false;
}

static String randomPortalSecret() {
  char value[25];
  for (uint8_t i = 0; i < 12; ++i) snprintf(value + i * 2, 3, "%02X", static_cast<unsigned>(esp_random() & 0xff));
  return String(value);
}

static void releaseAllGpioHoldsAtBoot() {
  gpio_deep_sleep_hold_dis();
  for (int gpio = 0; gpio <= 48; ++gpio) {
    gpio_num_t gn = (gpio_num_t)gpio;
    if (!GPIO_IS_VALID_GPIO(gn)) continue;
    gpio_hold_dis(gn);
    if (rtc_gpio_is_valid_gpio(gn)) rtc_gpio_hold_dis(gn);
  }
}

static void clearConfigNVS() {
#if DEBUG_LOG
  DBG_PRINTLN("[NVS] clearConfigNVS()");
#endif
  String storeError;
  bool storeCleared = configStore.clearAll(storeError);
  if (storeCleared) recordNvsWrite();
  PairingRetryMetadataStore retryStore;
  String retryError;
  if (!retryStore.clear(retryError)) {
    storeCleared = false;
    if (storeError.length() == 0U) storeError = retryError;
  }
  bool legacyCleared = false;
  if (prefs.begin("dashcfg", false)) {
    legacyCleared = prefs.clear();
    prefs.end();
    if (legacyCleared) recordNvsWrite();
    if (legacyCleared && prefs.begin("dashcfg", true)) {
      const char* keys[] = {
        "last_epoch", "last_ntp", "wifi_bssid", "wifi_channel",
        "offretry_attempt", "offretry_epoch", "offretry_next",
        "ack_item", "ack_version", "ack_event", "ack_attempt", "ack_next",
        "ssid", "pass", "hostport", "ca_pem", "devtoken", "tzmin", "tz",
        "hour", "minute", "rot180", "prefetch", "delivery", "button", "cfgver", "scnt",
      };
      for (const char* key : keys) {
        if (prefs.isKey(key)) {
          legacyCleared = false;
          break;
        }
      }
      prefs.end();
    } else {
      legacyCleared = false;
    }
  }
  if (!storeCleared || !legacyCleared) {
    lastDeviceErrorCode = "PAIRING-NVS-006";
    lastDeviceErrorMessage = storeError.length() > 0U ? storeError : "NVS clear/readback 失敗";
  }
}

static bool isFactoryResetRequestedAtBoot() {
  if (kBoardConfig.buttons.factoryReset == inktime::kNoPin) return false;
  pinMode(
    kBoardConfig.buttons.factoryReset,
    kBoardConfig.buttons.factoryResetActiveLow ? INPUT_PULLUP : INPUT_PULLDOWN
  );
  delay(FACTORY_RESET_SAMPLE_DELAY_MS);
  const int activeLevel = kBoardConfig.buttons.factoryResetActiveLow ? LOW : HIGH;
  return digitalRead(kBoardConfig.buttons.factoryReset) == activeLevel;
}

static void saveLastTimeEpoch(time_t epoch) {
  prefs.begin("dashcfg", false);
  const size_t written = prefs.putULong("last_epoch", (uint32_t)epoch);
  prefs.end();
  if (written > 0U) recordNvsWrite();
#if DEBUG_LOG
  DBG_PRINT("[TIME] save last_epoch="); DBG_PRINTLN((uint32_t)epoch);
#endif
}

static bool loadLastTimeEpoch(time_t &epochOut) {
  prefs.begin("dashcfg", true);
  uint32_t v = prefs.getULong("last_epoch", 0);
  prefs.end();
  if (v == 0) return false;
  epochOut = (time_t)v;
  return true;
}

#if INKTIME_PHOTOPAINTER_ENABLED
static bool loadOfflineRetryState(
  uint8_t &attemptOut, int64_t &epochOut, int64_t &nextSlotOut) {
  prefs.begin("dashcfg", true);
  const uint8_t storedAttempt = prefs.getUChar("offretry_attempt", 0U);
  const int64_t storedEpoch = prefs.getLong64("offretry_epoch", 0);
  const int64_t storedNextSlot = prefs.getLong64("offretry_next", 0);
  prefs.end();
  attemptOut = storedAttempt > 2U ? 2U : storedAttempt;
  epochOut = storedEpoch;
  nextSlotOut = storedNextSlot;
  return storedEpoch > 0;
}

static void saveOfflineRetryState(uint8_t attempt, int64_t epoch, int64_t nextSlotEpoch) {
  prefs.begin("dashcfg", false);
  const size_t attemptWritten = prefs.putUChar(
    "offretry_attempt", attempt > 2U ? 2U : attempt);
  const size_t epochWritten = prefs.putLong64("offretry_epoch", epoch);
  const size_t nextWritten = prefs.putLong64(
    "offretry_next", nextSlotEpoch > 0 ? nextSlotEpoch : 0);
  prefs.end();
  if (attemptWritten > 0U) recordNvsWrite();
  if (epochWritten > 0U) recordNvsWrite();
  if (nextWritten > 0U) recordNvsWrite();
}

static void clearOfflineRetryState() {
  prefs.begin("dashcfg", false);
  if (prefs.remove("offretry_attempt")) recordNvsWrite();
  if (prefs.remove("offretry_epoch")) recordNvsWrite();
  if (prefs.remove("offretry_next")) recordNvsWrite();
  prefs.end();
}

static time_t scheduleOfflineRecovery(
  time_t nowEpoch, int64_t serverRetryEpoch = 0, int64_t nextSlotEpoch = 0) {
  if (nowEpoch <= 0) return 0;
  uint8_t attempt = 0U;
  int64_t storedEpoch = 0;
  int64_t storedNextSlot = 0;
  loadOfflineRetryState(attempt, storedEpoch, storedNextSlot);
  if (serverRetryEpoch <= 0 && inktime::validOfflineRetryEpoch(
        static_cast<uint64_t>(nowEpoch), storedEpoch, storedNextSlot)) {
    return static_cast<time_t>(storedEpoch);
  }
  const inktime::OfflineRetryPlan plan = inktime::buildOfflineRetryPlan(
    static_cast<uint64_t>(nowEpoch), attempt, serverRetryEpoch, nextSlotEpoch);
  saveOfflineRetryState(
    plan.nextAttempt,
    static_cast<int64_t>(plan.sleepUntilEpoch),
    nextSlotEpoch > 0 ? nextSlotEpoch : 0);
  return static_cast<time_t>(plan.sleepUntilEpoch);
}
#endif

#if INKTIME_PHOTOPAINTER_ENABLED
// Preferences keys are kept under the ESP32 NVS key-size limit; these two
// bounded keys represent preview_schedule_id and preview_slot_index.
static int16_t loadPreviewCursorForSchedule(const String &scheduleId) {
  prefs.begin("dashcfg", true);
  const String storedScheduleId = prefs.getString("preview_sched", "");
  const int32_t storedIndex = prefs.getInt("preview_idx", -1);
  prefs.end();
  if (storedScheduleId != scheduleId) {
    prefs.begin("dashcfg", false);
    const size_t scheduleWritten = prefs.putString("preview_sched", scheduleId);
    const size_t indexWritten = prefs.putInt("preview_idx", -1);
    prefs.end();
    if (scheduleWritten > 0U) recordNvsWrite();
    if (indexWritten > 0U) recordNvsWrite();
    return -1;
  }
  return storedIndex < 0 || storedIndex > 127 ? -1 : static_cast<int16_t>(storedIndex);
}

static void savePreviewCursor(const String &scheduleId, int16_t slotIndex) {
  prefs.begin("dashcfg", false);
  const size_t scheduleWritten = prefs.putString("preview_sched", scheduleId);
  const size_t indexWritten = prefs.putInt("preview_idx", slotIndex);
  prefs.end();
  if (scheduleWritten > 0U) recordNvsWrite();
  if (indexWritten > 0U) recordNvsWrite();
}
#endif

#if INKTIME_PHOTOPAINTER_ENABLED
static bool loadLastPhotoIndex(size_t fileCount, size_t &indexOut) {
  if (fileCount == 0) return false;
  prefs.begin("dashcfg", true);
  const uint32_t value = prefs.getULong("photo_idx", UINT32_MAX);
  prefs.end();
  if (value == UINT32_MAX || value >= fileCount) return false;
  indexOut = static_cast<size_t>(value);
  return true;
}

static void saveLastPhotoIndex(size_t index) {
  prefs.begin("dashcfg", false);
  const size_t written = prefs.putULong("photo_idx", static_cast<uint32_t>(index));
  prefs.end();
  if (written > 0U) recordNvsWrite();
}
#endif

static StoredDisplayRecord loadDisplayRecord() {
  prefs.begin("dashcfg", true);
  const uint8_t version = prefs.getUChar("disp_ver", 0);
  StoredDisplayRecord record = {
    prefs.getString("last_sha", ""),
    prefs.getString("last_rel", ""),
    prefs.getString("last_prof", ""),
    prefs.getString("last_board", ""),
    static_cast<int16_t>(prefs.getShort("last_rot", -1)),
    prefs.getBool("last_ok", false),
    false,
  };
  prefs.end();
  record.valid = version == 1U
    && inktime::isSha256HexValue(record.sha256.c_str())
    && record.releaseId.length() > 0U && record.releaseId.length() <= 128U
    && record.renderProfile.length() > 0U && record.renderProfile.length() <= 64U
    && record.boardProfile.length() > 0U && record.boardProfile.length() <= 96U
    && (record.rotation == 0 || record.rotation == 180);
  return record;
}

#if INKTIME_PHOTOPAINTER_ENABLED
static void runFormalFrameGcForWake() {
  String activeScheduleJson;
  String stagedNextScheduleJson;
  (void)photoPainter.readActiveSchedule(activeScheduleJson);
  (void)photoPainter.readStagedNextSchedule(stagedNextScheduleJson);
  const StoredDisplayRecord lastGood = loadDisplayRecord();
  const char* lastGoodSha256 = lastGood.valid && lastGood.succeeded
    ? lastGood.sha256.c_str()
    : nullptr;
  const char* recoverySha256 = offlineScheduleTxnBlocked
    && inktime::isSha256Hex(currentPayloadSha256.c_str())
    ? currentPayloadSha256.c_str()
    : nullptr;
  // Formal Frame GC is best-effort.  Transactional .tmp/.bak artifacts remain
  // outside the candidate set, while the active/staged/current/last-good and
  // recovery references are explicit protection fences.
  (void)photoPainter.runFormalFrameGc(
    activeScheduleJson.c_str(),
    stagedNextScheduleJson.c_str(),
    currentPayloadSha256.c_str(),
    lastGoodSha256,
    photoPainter.inFlightFormalFrameSha256(),
    recoverySha256);
}
#endif

static void saveDisplayRecord(const Config &cfg, bool succeeded) {
  if (!inktime::isSha256HexValue(currentPayloadSha256.c_str())
      || currentReleaseId.length() == 0U || currentReleaseId.length() > 128U
      || currentRenderProfile.length() == 0U || currentRenderProfile.length() > 64U) {
    return;
  }
  prefs.begin("dashcfg", false);
  const size_t versionWritten = prefs.putUChar("disp_ver", 1U);
  const size_t shaWritten = prefs.putString("last_sha", currentPayloadSha256);
  const size_t releaseWritten = prefs.putString("last_rel", currentReleaseId);
  const size_t profileWritten = prefs.putString("last_prof", currentRenderProfile);
  const size_t boardWritten = prefs.putString("last_board", kBoardConfig.name);
  const size_t rotationWritten = prefs.putShort("last_rot", cfg.rotate180 ? 180 : 0);
  const size_t successWritten = prefs.putBool("last_ok", succeeded);
  prefs.end();
  if (versionWritten > 0U) recordNvsWrite();
  if (shaWritten > 0U) recordNvsWrite();
  if (releaseWritten > 0U) recordNvsWrite();
  if (profileWritten > 0U) recordNvsWrite();
  if (boardWritten > 0U) recordNvsWrite();
  if (rotationWritten > 0U) recordNvsWrite();
  if (successWritten > 0U) recordNvsWrite();
}

static bool shouldSkipCurrentDisplay(const Config &cfg) {
  const StoredDisplayRecord stored = loadDisplayRecord();
#if INKTIME_PHOTOPAINTER_ENABLED
  const bool forcedRefresh = photoPainter.forceNetworkRefresh();
#else
  const bool forcedRefresh = false;
#endif
  const inktime::DisplayRecord record = {
    stored.sha256.c_str(),
    stored.releaseId.c_str(),
    stored.renderProfile.c_str(),
    stored.boardProfile.c_str(),
    stored.rotation,
    stored.succeeded,
    stored.valid,
  };
  const inktime::DisplayCandidate candidate = {
    currentPayloadSha256.c_str(),
    currentReleaseId.c_str(),
    currentRenderProfile.c_str(),
    kBoardConfig.name,
    static_cast<int16_t>(cfg.rotate180 ? 180 : 0),
    currentPayloadShaVerified,
    currentPayloadIntegrityTrusted,
    forcedRefresh,
    false,
    false,
  };
  return inktime::shouldSkipDisplay(record, candidate);
}

static bool validPendingQueueAck(PendingQueueAck &pending) {
  const uint8_t event = static_cast<uint8_t>(pending.event);
  pending.valid = inktime::boundedText(
      pending.queueItemId.c_str(), inktime::kQueueIdentifierMaxBytes)
    && pending.queueVersion >= 0
    && event <= static_cast<uint8_t>(inktime::QueueEvent::DisplayFailed)
    && pending.errorCode.length() <= 64U
    && pending.eventEpoch >= 0
    && (!pending.delayedTerminal || (
        (pending.event == inktime::QueueEvent::DisplayCompleted
          || pending.event == inktime::QueueEvent::DisplayFailed)
        && inktime::boundedText(pending.releaseId.c_str(), inktime::kQueueIdentifierMaxBytes)));
  return pending.valid;
}

static String ackJournalKey(char prefix, uint8_t index) {
  return String(prefix) + String(index);
}

static String ackJournalBlobKey(uint8_t index) {
  return String("b") + String(index);
}

struct __attribute__((packed)) AckJournalBlob {
  uint32_t magic;
  uint8_t version;
  uint8_t flags;
  int32_t queue_version;
  uint8_t event;
  uint8_t reserved;
  int64_t event_epoch;
  uint16_t item_length;
  uint16_t error_length;
  uint16_t release_length;
  char queue_item_id[inktime::kQueueIdentifierMaxBytes + 1U];
  char error_code[65U];
  char release_id[inktime::kQueueIdentifierMaxBytes + 1U];
  uint32_t crc32;
};

// NVS budget: kMaxAckJournalEntries compact blobs plus the count key share the
// acklog namespace with no per-field fan-out.  The bounded entry size leaves
// room for the existing Config A/B, retry, and large-CA records on the target
// partition while keeping one event within one blob write/readback boundary.

static constexpr uint32_t kAckJournalBlobMagic = 0x49544A31U;
static constexpr uint8_t kAckJournalBlobVersion = 1U;

static uint32_t ackJournalCrc(const AckJournalBlob &blob) {
  const uint8_t *bytes = reinterpret_cast<const uint8_t *>(&blob);
  uint32_t crc = 0xFFFFFFFFU;
  for (size_t index = 0; index < offsetof(AckJournalBlob, crc32); ++index) {
    crc ^= bytes[index];
    for (uint8_t bit = 0; bit < 8U; ++bit) {
      crc = (crc & 1U) != 0U ? (crc >> 1U) ^ 0xEDB88320U : crc >> 1U;
    }
  }
  return crc ^ 0xFFFFFFFFU;
}

static bool copyAckJournalText(char *destination, size_t capacity, const String &value) {
  if (destination == nullptr || value.length() >= capacity) return false;
  memcpy(destination, value.c_str(), value.length());
  destination[value.length()] = '\0';
  return true;
}

static bool decodeAckJournalBlob(
  const AckJournalBlob &blob,
  PendingQueueAck &pending
) {
  if (blob.magic != kAckJournalBlobMagic
      || blob.version != kAckJournalBlobVersion
      || blob.crc32 != ackJournalCrc(blob)
      || blob.item_length >= sizeof(blob.queue_item_id)
      || blob.error_length >= sizeof(blob.error_code)
      || blob.release_length >= sizeof(blob.release_id)
      || blob.queue_item_id[blob.item_length] != '\0'
      || blob.error_code[blob.error_length] != '\0'
      || blob.release_id[blob.release_length] != '\0') {
    return false;
  }
  pending = {
    String(blob.queue_item_id),
    blob.queue_version,
    static_cast<inktime::QueueEvent>(blob.event),
    (blob.flags & 0x01U) != 0U,
    String(blob.error_code),
    (blob.flags & 0x02U) != 0U,
    String(blob.release_id),
    blob.event_epoch,
    false,
  };
  return validPendingQueueAck(pending);
}

static PendingQueueAck readAckJournalEntry(Preferences &journal, uint8_t index) {
  PendingQueueAck pending = {};
  const String blobKey = ackJournalBlobKey(index);
  const size_t blobLength = journal.getBytesLength(blobKey.c_str());
  if (blobLength > 0U) {
    AckJournalBlob blob = {};
    if (blobLength == sizeof(blob)
        && journal.getBytes(blobKey.c_str(), &blob, sizeof(blob)) == sizeof(blob)
        && decodeAckJournalBlob(blob, pending)) {
      return pending;
    }
    lastDeviceErrorCode = "DEVICE-QUEUE-ACK-JOURNAL";
    lastDeviceErrorMessage = "ACK journal compact blob CRC／readback 驗證失敗";
    return pending;
  }
  // Read the pre-blob per-field representation for one-time migration.
  pending = {
    journal.getString(ackJournalKey('i', index).c_str(), ""),
    journal.getInt(ackJournalKey('v', index).c_str(), -1),
    static_cast<inktime::QueueEvent>(
      journal.getUChar(ackJournalKey('e', index).c_str(), 255U)),
    journal.getBool(ackJournalKey('s', index).c_str(), false),
    journal.getString(ackJournalKey('r', index).c_str(), ""),
    journal.getBool(ackJournalKey('d', index).c_str(), false),
    journal.getString(ackJournalKey('l', index).c_str(), ""),
    journal.getLong64(ackJournalKey('t', index).c_str(), 0),
    false,
  };
  validPendingQueueAck(pending);
  return pending;
}

static bool writeAckJournalEntry(
  Preferences &journal,
  uint8_t index,
  const PendingQueueAck &pending
) {
  AckJournalBlob blob = {};
  blob.magic = kAckJournalBlobMagic;
  blob.version = kAckJournalBlobVersion;
  blob.flags = (pending.displaySkipped ? 0x01U : 0U)
    | (pending.delayedTerminal ? 0x02U : 0U);
  blob.queue_version = pending.queueVersion;
  blob.event = static_cast<uint8_t>(pending.event);
  blob.event_epoch = pending.eventEpoch;
  blob.item_length = static_cast<uint16_t>(pending.queueItemId.length());
  blob.error_length = static_cast<uint16_t>(pending.errorCode.length());
  blob.release_length = static_cast<uint16_t>(pending.releaseId.length());
  if (!pending.valid
      || !copyAckJournalText(blob.queue_item_id, sizeof(blob.queue_item_id), pending.queueItemId)
      || !copyAckJournalText(blob.error_code, sizeof(blob.error_code), pending.errorCode)
      || !copyAckJournalText(blob.release_id, sizeof(blob.release_id), pending.releaseId)) {
    lastDeviceErrorCode = "DEVICE-QUEUE-ACK-JOURNAL";
    lastDeviceErrorMessage = "ACK journal compact blob 欄位超出安全容量";
    return false;
  }
  blob.crc32 = ackJournalCrc(blob);
  const String blobKey = ackJournalBlobKey(index);
  const size_t written = journal.putBytes(blobKey.c_str(), &blob, sizeof(blob));
  if (written != sizeof(blob)) {
    lastDeviceErrorCode = "DEVICE-QUEUE-ACK-JOURNAL";
    lastDeviceErrorMessage = "ACK journal NVS blob 寫入失敗";
    return false;
  }
  AckJournalBlob readback = {};
  const bool readbackOk = journal.getBytesLength(blobKey.c_str()) == sizeof(readback)
    && journal.getBytes(blobKey.c_str(), &readback, sizeof(readback)) == sizeof(readback)
    && readback.crc32 == ackJournalCrc(readback)
    && readback.magic == kAckJournalBlobMagic
    && readback.version == kAckJournalBlobVersion;
  if (!readbackOk) {
    lastDeviceErrorCode = "DEVICE-QUEUE-ACK-JOURNAL";
    lastDeviceErrorMessage = "ACK journal NVS blob readback／CRC 失敗";
    return false;
  }
  recordNvsWrite();
  return true;
}

static bool samePendingQueueAck(
  const PendingQueueAck &left,
  const PendingQueueAck &right
) {
  return left.queueItemId == right.queueItemId
    && left.queueVersion == right.queueVersion
    && left.event == right.event;
}

static bool terminalAckEvidence(const PendingQueueAck &pending) {
  return pending.delayedTerminal
    && (pending.event == inktime::QueueEvent::DisplayCompleted
      || pending.event == inktime::QueueEvent::DisplayFailed);
}

static uint8_t ackJournalCount(Preferences &journal) {
  return min(
    journal.getUChar("count", 0U),
    static_cast<uint8_t>(inktime::kMaxAckJournalEntries));
}

static uint8_t loadAckJournalEntries(
  PendingQueueAck *entries,
  uint8_t capacity
) {
  if (entries == nullptr || capacity == 0U) return 0U;
  Preferences journal;
  journal.begin("acklog", true);
  const uint8_t count = min(ackJournalCount(journal), capacity);
  uint8_t loaded = 0U;
  for (uint8_t index = 0; index < count; ++index) {
    PendingQueueAck pending = readAckJournalEntry(journal, index);
    if (pending.valid) entries[loaded++] = pending;
  }
  journal.end();
  return loaded;
}

static void removeLegacyPendingQueueAck() {
  prefs.begin("dashcfg", false);
  if (prefs.remove("ack_item")) recordNvsWrite();
  if (prefs.remove("ack_ver")) recordNvsWrite();
  if (prefs.remove("ack_event")) recordNvsWrite();
  if (prefs.remove("ack_skip")) recordNvsWrite();
  if (prefs.remove("ack_error")) recordNvsWrite();
  prefs.end();
}

