steven87090799/InkTime/esp32/ink-display-7C-photo/ink-display-7C-photo.ino
static bool persistPendingQueueAck(const PendingQueueAck &pending) {
  if (!pending.valid) return false;
  Preferences journal;
  if (!journal.begin("acklog", false)) {
    lastDeviceErrorCode = "DEVICE-QUEUE-ACK-JOURNAL";
    lastDeviceErrorMessage = "ACK journal NVS namespace 無法開啟";
    return false;
  }
  uint8_t count = ackJournalCount(journal);
  for (uint8_t index = 0; index < count; ++index) {
    const PendingQueueAck existing = readAckJournalEntry(journal, index);
    if (existing.valid && samePendingQueueAck(existing, pending)) {
      journal.end();
      return true;
    }
  }
  uint8_t insertAt = count;
  if (count >= inktime::kMaxAckJournalEntries) {
    uint8_t evictionIndex = count;
    for (uint8_t index = 0; index < count; ++index) {
      const PendingQueueAck existing = readAckJournalEntry(journal, index);
      if (existing.valid && !terminalAckEvidence(existing)) {
        evictionIndex = index;
        break;
      }
    }
    if (evictionIndex >= count) {
      // Terminal display evidence is the last class allowed to leave the
      // bounded journal.  If every entry is terminal, retain a visible
      // diagnostic while making the bounded forward-progress decision.
      evictionIndex = 0U;
      lastDeviceErrorCode = "DEVICE-QUEUE-ACK-JOURNAL-OVERFLOW";
      lastDeviceErrorMessage = "ACK journal 已滿，最舊 terminal display evidence 已淘汰";
    } else {
      lastDeviceWarningCode = "DEVICE-QUEUE-ACK-JOURNAL-COMPACTED";
      lastDeviceWarningMessage = "ACK journal 已滿，已優先淘汰可重建的 non-terminal ACK";
    }
    for (uint8_t index = evictionIndex + 1U; index < inktime::kMaxAckJournalEntries; ++index) {
      const PendingQueueAck shifted = readAckJournalEntry(journal, index);
      if (shifted.valid && !writeAckJournalEntry(journal, index - 1U, shifted)) {
        journal.end();
        return false;
      }
    }
    insertAt = inktime::kMaxAckJournalEntries - 1U;
  } else {
    ++count;
  }
  if (!writeAckJournalEntry(journal, insertAt, pending)) {
    journal.end();
    return false;
  }
  const size_t countWritten = journal.putUChar("count", count);
  if (countWritten != sizeof(uint8_t) || journal.getUChar("count", 0U) != count) {
    lastDeviceErrorCode = "DEVICE-QUEUE-ACK-JOURNAL";
    lastDeviceErrorMessage = "ACK journal count 寫入失敗";
    journal.end();
    return false;
  }
  recordNvsWrite();
  journal.end();
  return true;
}

static void removePendingQueueAck(const PendingQueueAck &pending) {
  Preferences journal;
  if (!journal.begin("acklog", false)) {
    lastDeviceErrorCode = "DEVICE-QUEUE-ACK-JOURNAL";
    lastDeviceErrorMessage = "ACK journal NVS namespace 無法開啟，無法移除已送出事件";
    return;
  }
  const uint8_t count = ackJournalCount(journal);
  uint8_t found = count;
  for (uint8_t index = 0; index < count; ++index) {
    const PendingQueueAck existing = readAckJournalEntry(journal, index);
    if (existing.valid && samePendingQueueAck(existing, pending)) {
      found = index;
      break;
    }
  }
  if (found < count) {
    for (uint8_t index = found + 1U; index < count; ++index) {
      const PendingQueueAck shifted = readAckJournalEntry(journal, index);
      if (shifted.valid) (void)writeAckJournalEntry(journal, index - 1U, shifted);
    }
    const uint8_t last = count - 1U;
    const String blobKey = ackJournalBlobKey(last);
    if (journal.getBytesLength(blobKey.c_str()) > 0U
        && journal.remove(blobKey.c_str())) recordNvsWrite();
    // Remove legacy fields too so an interrupted migration cannot resurrect
    // an already acknowledged event after the compact blob is cleared.
    const char legacyPrefixes[] = {'i', 'v', 'e', 's', 'r', 'd', 'l', 't'};
    for (const char prefix : legacyPrefixes) {
      if (journal.remove(ackJournalKey(prefix, last).c_str())) recordNvsWrite();
    }
    if (journal.putUChar("count", last) == sizeof(uint8_t)
        && journal.getUChar("count", 0U) == last) {
      recordNvsWrite();
    } else {
      lastDeviceErrorCode = "DEVICE-QUEUE-ACK-JOURNAL";
      lastDeviceErrorMessage = "ACK journal count 移除後寫入／readback 失敗";
    }
  }
  journal.end();
}

static PendingQueueAck loadPendingQueueAck() {
  Preferences journal;
  journal.begin("acklog", true);
  const uint8_t count = ackJournalCount(journal);
  for (uint8_t index = 0; index < count; ++index) {
    PendingQueueAck pending = readAckJournalEntry(journal, index);
    if (pending.valid) {
      journal.end();
      return pending;
    }
  }
  journal.end();

  // Migrate the pre-journal single pending record without losing an event
  // after an upgrade from the previous firmware.
  prefs.begin("dashcfg", true);
  PendingQueueAck legacy = {
    prefs.getString("ack_item", ""),
    prefs.getInt("ack_ver", -1),
    static_cast<inktime::QueueEvent>(prefs.getUChar("ack_event", 255U)),
    prefs.getBool("ack_skip", false),
    prefs.getString("ack_error", ""),
    false,
    "",
    0,
    false,
  };
  prefs.end();
  if (validPendingQueueAck(legacy)) {
    persistPendingQueueAck(legacy);
    removeLegacyPendingQueueAck();
    return legacy;
  }
  return legacy;
}

static void clearPendingQueueAck() {
  const PendingQueueAck pending = loadPendingQueueAck();
  if (pending.valid) removePendingQueueAck(pending);
}

static uint32_t minutesToNextRefreshFromLastEpoch(const Config &cfg) {
  time_t lastEpoch;
  if (!loadLastTimeEpoch(lastEpoch)) {
    return 1440;
  }

  struct tm t;
  localtime_r(&lastEpoch, &t);

  int curMinOfDay = t.tm_hour * 60 + t.tm_min;
  int targetMin   = (int)cfg.refresh_hour * 60 + (int)cfg.refresh_minute;
  int deltaMin;

  if (curMinOfDay < targetMin) deltaMin = targetMin - curMinOfDay;
  else                         deltaMin = 24 * 60 - (curMinOfDay - targetMin);

  if (deltaMin < 1) deltaMin = 24 * 60;
  if (deltaMin > 1440) deltaMin = 1440;
  return (uint32_t)deltaMin;
}

// =======================
//  配置读写
// =======================
static inktime::configstore::ConfigPayload configPayload(const Config &cfg) {
  inktime::configstore::ConfigPayload payload;
  payload.wifi_ssid = cfg.wifi_ssid.c_str();
  payload.wifi_pass = cfg.wifi_pass.c_str();
  payload.backend_hostport = cfg.backend_hostport.c_str();
  payload.ca_pem = cfg.ca_pem.c_str();
  payload.device_token = cfg.device_token.c_str();
  payload.device_secret = cfg.device_secret.c_str();
  payload.device_id = cfg.device_id.c_str();
  payload.auth_state = cfg.auth_state.c_str();
  payload.credential_version = cfg.credential_version;
  payload.pairing_id = cfg.pairing_id.c_str();
  payload.pairing_nonce = cfg.pairing_nonce.c_str();
  payload.pairing_expires_at_epoch = cfg.pairing_expires_at_epoch;
  payload.pairing_retry_at_epoch = cfg.pairing_retry_at_epoch;
  payload.pairing_retry_attempt = cfg.pairing_retry_attempt;
  payload.tz_offset_minutes = cfg.tz_offset_minutes;
  payload.refresh_hour = cfg.refresh_hour;
  payload.refresh_minute = cfg.refresh_minute;
  payload.rotate180 = cfg.rotate180;
  payload.sync_strategy = cfg.sync_strategy.c_str();
  payload.sync_time = cfg.sync_time.c_str();
  payload.config_version = cfg.config_version;
#if INKTIME_PHOTOPAINTER_ENABLED
  payload.schedule_count = cfg.schedule_count;
  payload.prefetch_lead_minutes = cfg.prefetch_lead_minutes;
  payload.delivery_mode = cfg.delivery_mode.c_str();
  payload.button_wake_action = cfg.button_wake_action.c_str();
  for (uint8_t index = 0U; index < inktime::configstore::kMaxConfigSlots; ++index) {
    payload.schedule_slots[index] = {
      cfg.schedule_slots[index].hour,
      cfg.schedule_slots[index].minute,
    };
  }
#else
  payload.schedule_count = 1U;
  payload.schedule_slots[0] = {cfg.refresh_hour, cfg.refresh_minute};
  payload.delivery_mode = "legacy_online";
  payload.button_wake_action = "check_new";
#endif
  return payload;
}

