steven87090799/InkTime/esp32/ink-display-7C-photo/ink-display-7C-photo.ino
  inktime::DeviceHttpTransport requestTransport(cfg.ca_pem);
  HTTPClient requestHttp;
  String transportCode;
  String transportMessage;
  if (!requestTransport.begin(
        requestHttp, base + String(DEVICE_PAIRING_REQUEST_PATH), 15000,
        transportCode, transportMessage)) {
    (void)persistPairingRetry(cfg, "pairing_pending");
    lastDeviceErrorCode = transportCode.length() ? transportCode : "DEVICE-PAIRING-URL";
    lastDeviceErrorMessage = transportMessage.length() ? transportMessage : "配對 request URL 無法初始化";
    return false;
  }
  const char* pairingHeaders[] = {"Content-Type"};
  requestHttp.collectHeaders(pairingHeaders, 1);
  requestHttp.addHeader("Content-Type", "application/json");
  const int requestStatus = countedHttpPost(requestHttp, requestBody);
  const int requestLength = requestHttp.getSize();
  const String requestContentType = requestHttp.header("Content-Type");
  if ((requestStatus != HTTP_CODE_CREATED && requestStatus != HTTP_CODE_OK)
      || requestLength <= 0 || requestLength > 8192
      || !requestContentType.startsWith("application/json")) {
    requestHttp.end();
    (void)persistPairingRetry(cfg, "pairing_pending");
    lastDeviceErrorCode = "DEVICE-PAIRING-REQUEST";
    lastDeviceErrorMessage = "配對 request HTTP／Content-Type／長度不合法";
    return false;
  }
  JsonDocument requestResponse;
  const DeserializationError requestJsonError = deserializeJson(requestResponse, requestHttp.getStream());
  requestHttp.end();
  const String pairingId = requestResponse["pairing_id"] | "";
  const String pairingCode = requestResponse["pairing_code"] | "";
  const String requestState = requestResponse["status"] | "pending";
  const bool requestReused = requestResponse["request_reused"] | false;
  const JsonVariantConst expiresValue = requestResponse["expires_in_seconds"];
  const JsonVariantConst serverEpochValue = requestResponse["server_epoch"];
  uint64_t serverEpoch = serverEpochValue.is<uint64_t>()
    ? serverEpochValue.as<uint64_t>() : pairingNowEpoch();
  if (serverEpoch < kPairingMinimumEpoch) serverEpoch = pairingNowEpoch();
  const bool validCode = pairingCode.length() == 6U
    && pairingCode[0] >= '0' && pairingCode[0] <= '9'
    && pairingCode[1] >= '0' && pairingCode[1] <= '9'
    && pairingCode[2] >= '0' && pairingCode[2] <= '9'
    && pairingCode[3] >= '0' && pairingCode[3] <= '9'
    && pairingCode[4] >= '0' && pairingCode[4] <= '9'
    && pairingCode[5] >= '0' && pairingCode[5] <= '9';
  const bool requestPending = requestState == "pending";
  const bool requestClaimable = requestState == "approved" || requestState == "credential_issued";
  if (requestJsonError || requestResponse.overflowed() || pairingId.length() == 0U
      || !expiresValue.is<int32_t>() || expiresValue.is<bool>()
      || expiresValue.as<int32_t>() < 1 || expiresValue.as<int32_t>() > 300
      || serverEpoch < kPairingMinimumEpoch
      || (!requestPending && !requestClaimable)
      || (requestPending && !validCode)
      || (requestReused && cfg.pairing_nonce != pairingNonce)) {
    (void)persistPairingRetry(cfg, "pairing_pending");
    lastDeviceErrorCode = "DEVICE-PAIRING-SCHEMA";
    lastDeviceErrorMessage = "配對 request 回應 schema 不合法；不建立新的裝置 credential";
    return false;
  }
  Config candidate = cfg;
  candidate.pairing_id = pairingId;
  candidate.pairing_nonce = requestReused ? cfg.pairing_nonce : pairingNonce;
  candidate.pairing_expires_at_epoch = serverEpoch + static_cast<uint64_t>(expiresValue.as<int32_t>());
  candidate.pairing_retry_at_epoch = 0U;
  candidate.pairing_retry_attempt = 0U;
  candidate.auth_state = "pairing_pending";
  if (!savePairingCandidate(cfg, candidate)) return false;
#if INKTIME_PHOTOPAINTER_ENABLED
  if (requestPending && validCode) {
    (void)photoPainter.displayPairingScreen(
      cfg.wifi_ssid.c_str(), "", base.c_str(), pairingCode.c_str());
  }
#else
  if (requestPending && validCode) (void)displayPairingCode(cfg, pairingCode);
#endif
  return claimPairingCredential(cfg, base);
}

static bool queueAckIdempotencyKey(const PendingQueueAck &pending, String &key) {
  char material[320];
  if (!inktime::idempotencyMaterial(
        pending.queueItemId.c_str(), pending.queueVersion, pending.event, material, sizeof(material))) {
    return false;
  }
  unsigned char digest[32];
  if (calculateSha256(
        reinterpret_cast<const unsigned char*>(material), strlen(material), digest) != 0) {
    return false;
  }
  char output[65];
  for (size_t index = 0; index < 32U; ++index) {
    snprintf(output + index * 2U, 3U, "%02x", digest[index]);
  }
  output[64] = '\0';
  key = output;
  return true;
}

static PendingQueueAck ramQueueAckBatch[kQueueAckBatchMaxEvents] = {};
static uint8_t ramQueueAckBatchCount = 0U;

static bool terminalQueueAck(inktime::QueueEvent event) {
  return event == inktime::QueueEvent::DisplayCompleted
    || event == inktime::QueueEvent::DisplayFailed;
}

static void persistQueueAckBatch(
  const PendingQueueAck *pending,
  uint8_t count
) {
  if (pending == nullptr) return;
  for (uint8_t index = 0U; index < count; ++index) {
    persistPendingQueueAck(pending[index]);
  }
}

static bool serializeQueueAckBatch(
  const PendingQueueAck *pending,
  uint8_t count,
  String &body
) {
  if (pending == nullptr || count == 0U || count > kQueueAckBatchMaxEvents) return false;
  JsonDocument payload;
  JsonArray events = payload["events"].to<JsonArray>();
  for (uint8_t index = 0U; index < count; ++index) {
    if (!pending[index].valid) return false;
    String idempotencyKey;
    if (!queueAckIdempotencyKey(pending[index], idempotencyKey)) return false;
    JsonObject event = events.add<JsonObject>();
    event["queue_item_id"] = pending[index].queueItemId;
    event["queue_version"] = pending[index].queueVersion;
    event["event"] = inktime::queueEventName(pending[index].event);
    event["idempotency_key"] = idempotencyKey;
    if (pending[index].displaySkipped) {
      event["display_skipped"] = true;
      event["skip_reason"] = "same_sha256";
    }
    if (pending[index].delayedTerminal) {
      event["ack_mode"] = "delayed_terminal";
      event["release_id"] = pending[index].releaseId;
      if (pending[index].eventEpoch > 0) event["event_epoch"] = pending[index].eventEpoch;
    }
    if (pending[index].errorCode.length() > 0U) event["error_code"] = pending[index].errorCode;
  }
  body = "";
  serializeJson(payload, body);
  return !payload.overflowed() && body.length() > 0U
    && body.length() <= kQueueAckBatchMaxBodyBytes;
}

static bool postQueueAckBatch(
  Config &cfg,
  const PendingQueueAck *pending,
  uint8_t count,
  bool allowRetainedTerminal = false
) {
  if (pending == nullptr || count == 0U) return true;
  queueAckPermanentReject = false;
  if (deviceAuthInvalid) {
    persistQueueAckBatch(pending, count);
    return false;
  }
  String body;
  if (!serializeQueueAckBatch(pending, count, body)) {
    persistQueueAckBatch(pending, count);
    lastDeviceErrorCode = "DEVICE-QUEUE-ACK-SCHEMA";
    lastDeviceErrorMessage = "Queue ACK batch body 超過有界 schema 或 idempotency 建立失敗";
    return false;
  }

