steven87090799/InkTime/esp32/ink-display-7C-photo/ink-display-7C-photo.ino
  String base;
  if (!ensureWakeHttpSession(cfg, base) || WiFi.status() != WL_CONNECTED) {
    persistQueueAckBatch(pending, count);
    return false;
  }

  for (uint8_t attempt = 0U; attempt <= inktime::kQueueRetryLimit; ++attempt) {
    HTTPClient ackHttp;
    String transportCode;
    String transportMessage;
    if (!wakeHttpTransport.begin(
          ackHttp, base + String(DEVICE_QUEUE_ACK_BATCH_PATH), 15000,
          transportCode, transportMessage)) {
      lastDeviceErrorCode = transportCode;
      lastDeviceErrorMessage = transportMessage;
      break;
    }
    if (!addDeviceAuthorization(ackHttp, cfg)) {
      ackHttp.end();
      persistQueueAckBatch(pending, count);
      return false;
    }
    const char* responseHeaders[] = {"Content-Type"};
    ackHttp.collectHeaders(responseHeaders, 1);
    ackHttp.addHeader("Content-Type", "application/json");
    if (runtimeTelemetry.ack_batch_request_count < UINT32_MAX) {
      ++runtimeTelemetry.ack_batch_request_count;
    }
    const int status = countedHttpPost(ackHttp, body);
    const bool authFailed = handleDeviceAuthStatus(cfg, status);
    const int responseLength = ackHttp.getSize();
    const String responseContentType = ackHttp.header("Content-Type");
    if (authFailed) {
      ackHttp.end();
      persistQueueAckBatch(pending, count);
      return false;
    }

    if (status == HTTP_CODE_OK && responseLength > 0 && responseLength <= 12 * 1024
        && responseContentType.startsWith("application/json")) {
      JsonDocument response;
      const DeserializationError responseError = deserializeJson(response, ackHttp.getStream());
      const String responseStatus = response["status"] | "";
      const JsonArrayConst results = response["results"].as<JsonArrayConst>();
      const bool responseValid = !responseError && !response.overflowed()
        && responseStatus == "ok" && !results.isNull() && results.size() == count;
      if (responseValid) {
        bool allResolved = true;
        bool stale = false;
        bool retainedTerminal = false;
        bool unresolvedOther = false;
        bool permanentRejected = false;
        for (uint8_t index = 0U; index < count; ++index) {
          const JsonObjectConst result = results[index].as<JsonObjectConst>();
          const String responseItem = result["queue_item_id"] | "";
          const String responseEvent = result["event"] | "";
          const String outcome = result["status"] | "";
          const String errorCode = result["error_code"] | "";
          const bool identityMatches = responseItem == pending[index].queueItemId
            && responseEvent == inktime::queueEventName(pending[index].event);
          if (identityMatches && outcome == "accepted") {
            removePendingQueueAck(pending[index]);
            continue;
          }
          if (identityMatches && errorCode == "QUEUE-003") {
            // A terminal event is crash-safe evidence, even when the queue
            // version has moved on before the next wake.  Keep it durable so
            // delayed-terminal recovery can still be accepted; dropping it
            // here would turn a transient stale response into lost history.
            if (terminalQueueAck(pending[index].event)) {
              persistPendingQueueAck(pending[index]);
              allResolved = false;
              stale = true;
              retainedTerminal = true;
              continue;
            }
            removePendingQueueAck(pending[index]);
            stale = true;
            permanentRejected = true;
            queueAckPermanentReject = true;
            continue;
          }
          if (identityMatches && errorCode.length() > 0U) {
            // A per-event 4xx result is authoritative for this item.  Do not
            // keep retrying it or strand later config/schedule work in this
            // wake; quarantine the event and expose the rejection.
            removePendingQueueAck(pending[index]);
            permanentRejected = true;
            queueAckPermanentReject = true;
            continue;
          }
          persistPendingQueueAck(pending[index]);
          allResolved = false;
          unresolvedOther = true;
          queueAckPermanentReject = true;
        }
        ackHttp.end();
        if (stale) {
          lastDeviceErrorCode = "DEVICE-QUEUE-STALE";
          lastDeviceErrorMessage = "QUEUE-003 Queue version 已過期；下次重新取得 Manifest";
        }
        if (permanentRejected) {
          lastDeviceErrorCode = "DEVICE-QUEUE-ACK-PERMANENT";
          lastDeviceErrorMessage = "Queue ACK 已被伺服器永久拒絕；事件已 quarantine，本輪繼續後續工作";
        }
        if (allResolved) return true;
        if (allowRetainedTerminal && retainedTerminal && !unresolvedOther) return true;
        lastDeviceErrorCode = stale ? lastDeviceErrorCode : "DEVICE-QUEUE-ACK-REJECTED";
        lastDeviceErrorMessage = stale
          ? lastDeviceErrorMessage
          : "Queue ACK batch 含有拒絕事件；拒絕項目已 durable 保留";
        return false;
      }
    }

    ackHttp.end();
    const inktime::AckDecision decision = inktime::ackDecision(status, attempt);
    if (decision == inktime::AckDecision::StaleManifest) {
      persistQueueAckBatch(pending, count);
      lastDeviceErrorCode = "DEVICE-QUEUE-STALE";
      lastDeviceErrorMessage = "Queue ACK batch HTTP 409；pending events 已 durable 保留";
      return false;
    }
    if (decision == inktime::AckDecision::AuthorizationFailed) {
      persistQueueAckBatch(pending, count);
      lastDeviceErrorCode = "DEVICE-QUEUE-AUTH";
      lastDeviceErrorMessage = "Queue ACK Token／authorization 被拒絕";
      return false;
    }
    if (status == 429) {
      // Rate limiting is transient.  Keep the complete batch durable even
      // after the bounded retry budget is exhausted; it must never enter the
      // permanent-4xx quarantine path below.
      if (decision == inktime::AckDecision::Retry) {
        delay(250U * (attempt + 1U));
        continue;
      }
      break;
    }
    if (status >= 400 && status < 500 && status != HTTP_CODE_CONFLICT) {
      queueAckPermanentReject = true;
      for (uint8_t index = 0U; index < count; ++index) {
        removePendingQueueAck(pending[index]);
      }
      lastDeviceErrorCode = "DEVICE-QUEUE-ACK-PERMANENT";
      lastDeviceErrorMessage = "Queue ACK HTTP 4xx 已永久拒絕；事件已 quarantine，本輪繼續後續工作";
      return true;
    }
    if (decision != inktime::AckDecision::Retry) break;
    delay(250U * (attempt + 1U));
  }
  persistQueueAckBatch(pending, count);
  lastDeviceErrorCode = "DEVICE-QUEUE-ACK-RETRY";
  lastDeviceErrorMessage = "Queue ACK batch 已達有界 retry 上限；pending events 已 durable 保留";
  return false;
}

static bool flushRamQueueAckBatch(Config &cfg) {
  if (ramQueueAckBatchCount == 0U) return true;
  PendingQueueAck pending[kQueueAckBatchMaxEvents] = {};
  const uint8_t count = ramQueueAckBatchCount;
  for (uint8_t index = 0U; index < count; ++index) pending[index] = ramQueueAckBatch[index];
  ramQueueAckBatchCount = 0U;
  return postQueueAckBatch(cfg, pending, count);
}

static bool sendQueueEvent(
  Config &cfg,
  inktime::QueueEvent event,
  bool displaySkipped = false,
  const String &errorCode = String(""),
  bool delayedTerminal = false
) {
  const time_t eventNow = time(nullptr);
  PendingQueueAck pending = {
    currentQueueItemId,
    static_cast<int32_t>(currentQueueVersion),
    event,
    displaySkipped,
    errorCode.substring(0, 64),
    delayedTerminal,
    currentReleaseId,
    delayedTerminal && eventNow > 0 ? static_cast<int64_t>(eventNow) : 0,
    currentQueueItemId.length() > 0U && currentQueueVersion >= 0,
  };
  if (!pending.valid) return false;
  if (runtimeTelemetry.ack_event_count < UINT32_MAX) ++runtimeTelemetry.ack_event_count;
  if (terminalQueueAck(event) && !persistPendingQueueAck(pending)) return false;
  if (deviceAuthInvalid) return false;
  if (WiFi.status() != WL_CONNECTED) return false;
  if (ramQueueAckBatchCount >= kQueueAckBatchMaxEvents && !flushRamQueueAckBatch(cfg)) {
    if (!terminalQueueAck(event)) (void)persistPendingQueueAck(pending);
    return false;
  }
  ramQueueAckBatch[ramQueueAckBatchCount++] = pending;
  if (terminalQueueAck(event)) return flushRamQueueAckBatch(cfg);
  return ramQueueAckBatchCount < kQueueAckBatchMaxEvents
    || flushRamQueueAckBatch(cfg);
}

