steven87090799/InkTime/esp32/ink-display-7C-photo/ink-display-7C-photo.ino
    String fileUrl = base + String(downloadBaseRaw) + fileName;
    inktime::DeviceHttpTransport &fileTransport = wakeHttpTransport;
    HTTPClient fileHttp;
    String fileTransportCode;
    String fileTransportMessage;
    const char* fileHeaders[] = {"Content-Type"};
    fileHttp.collectHeaders(fileHeaders, 1);
    if (!fileTransport.begin(fileHttp, fileUrl, 60000, fileTransportCode, fileTransportMessage)) {
      lastDeviceErrorCode = fileTransportCode;
      lastDeviceErrorMessage = fileTransportMessage;
      continue;
    }
    if (!addDeviceAuthorization(fileHttp, cfg)) {
      fileHttp.end();
      continue;
    }
    int code = countedHttpGet(fileHttp);
    if (handleDeviceAuthStatus(cfg, code)) {
      fileHttp.end();
      heap_caps_free(packed);
      return false;
    }
    const String fileContentType = fileHttp.header("Content-Type");
    if (code != HTTP_CODE_OK || fileHttp.getSize() != (int)packedSize
        || !fileContentType.startsWith("application/octet-stream")) {
      fileHttp.end();
      continue;
    }

    WiFiClient *stream = fileHttp.getStreamPtr();
    size_t total = 0;
    uint32_t started = millis();
    while (total < packedSize && millis() - started < 60000) {
      size_t available = stream->available();
      if (!available) {
        if (!fileHttp.connected()) break;
        delay(1);
        continue;
      }
      size_t count = min(available, packedSize - total);
      int received = stream->read(packed + total, count);
      if (received > 0) {
        total += received;
        runtimeTelemetry.download_bytes += static_cast<uint32_t>(received);
      }
    }
    fileHttp.end();
    if (total != packedSize) continue;

    unsigned char digest[32];
    if (calculateSha256(packed, packedSize, digest) != 0) continue;
    char actualSha[65];
    for (int i = 0; i < 32; ++i) sprintf(actualSha + i * 2, "%02x", digest[i]);
    actualSha[64] = '\0';
    if (!expectedSha.equalsIgnoreCase(String(actualSha))) continue;
    currentPayloadShaVerified = true;
    currentPayloadIntegrityTrusted = true;
    currentPayloadSha256 = expectedSha;

    // 完整下載與 SHA-256 都通過後才替換資料。
    if (frameData) heap_caps_free(frameData);
#if INKTIME_PHOTOPAINTER_ENABLED
    uint8_t* nativeFrame = nullptr;
    if (!photoPainter.convertAndCache(
          packed,
          packedSize,
          indexed4,
          sourceHash,
          rotation,
          &nativeFrame,
          expectedSha.c_str())) {
      frameData = nullptr;
      lastDeviceErrorCode = photoPainter.lastError();
      lastDeviceErrorMessage = "PhotoPainter framebuffer 轉換失敗";
      continue;
    }
    heap_caps_free(packed);
    frameData = nativeFrame;
    frameDataSize = inktime::kPhotoPainterFrameBytes;
    frameIndexed4 = true;
    frameNativePalette = true;
#else
    frameData = packed;
    frameDataSize = packedSize;
    frameIndexed4 = indexed4;
    frameNativePalette = false;
#endif
    currentReleaseId = manifest["release_id"] | "";
    currentRenderProfile = renderProfile;
#if INKTIME_PHOTOPAINTER_ENABLED
    saveLastPhotoIndex(fileIndex);
#endif
    return true;
  }

  heap_caps_free(packed);
  lastDeviceErrorCode = "DEVICE-DOWNLOAD";
  lastDeviceErrorMessage = "所有發布檔案下載或 SHA-256 校驗失敗";
  return false;
}

#if INKTIME_PHOTOPAINTER_ENABLED
static bool downloadOfflineScheduleSlot(
  Config &cfg,
  inktime::DisplayRotation rotation,
  const String &base,
  const String &downloadUrl,
  const String &expectedSha,
  const String &pixelFormat,
  int64_t expectedSize
) {
  if (!inktime::isSha256Hex(expectedSha.c_str())
      || !inktime::isSafeQueueDownloadPath(downloadUrl.c_str(), downloadUrl.length())) {
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-ITEM";
    lastDeviceErrorMessage = "離線排程 Slot 身分或下載路徑不合法";
    return false;
  }
  const bool indexed4 = pixelFormat == "indexed4";
  if (pixelFormat != "indexed4" && pixelFormat != "2bpp") {
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-ITEM";
    lastDeviceErrorMessage = "離線排程 Slot pixel_format 不相容";
    return false;
  }
  const size_t packedSize = static_cast<size_t>(FB_WIDTH) * FB_HEIGHT
    / (indexed4 ? 2U : 4U);
  if (expectedSize != static_cast<int64_t>(packedSize)) {
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-SIZE";
    lastDeviceErrorMessage = "離線排程 Slot size 與 pixel format 不一致";
    return false;
  }
  // A verified formal frame is content-addressed by SHA and rotation.  Reuse
  // it for a later schedule instead of downloading and converting the same
  // release again; the caller still emits the normal queue download/hash ACKs.
  uint8_t* cachedFormalFrame = nullptr;
  if (photoPainter.loadFormalFrame(expectedSha.c_str(), rotation, &cachedFormalFrame)) {
    if (cachedFormalFrame != nullptr) heap_caps_free(cachedFormalFrame);
    return true;
  }
  String sessionBase;
  if (!ensureWakeHttpSession(cfg, sessionBase) || sessionBase != base) {
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-SESSION";
    lastDeviceErrorMessage = "離線排程 Slot 未繫結目前 Wake Backend Origin";
    return false;
  }
  uint8_t* packed = photoPainter.allocateWireBuffer(packedSize);
  if (packed == nullptr) {
    lastDeviceErrorCode = "DEVICE-MEMORY";
    lastDeviceErrorMessage = "無法配置離線排程 Slot 緩衝區";
    return false;
  }
  inktime::DeviceHttpTransport &fileTransport = wakeHttpTransport;
  HTTPClient fileHttp;
  String fileTransportCode;
  String fileTransportMessage;
  const char* fileHeaders[] = {"Content-Type"};
  fileHttp.collectHeaders(fileHeaders, 1);
  if (!fileTransport.begin(fileHttp, base + downloadUrl, 60000, fileTransportCode, fileTransportMessage)) {
    heap_caps_free(packed);
    lastDeviceErrorCode = fileTransportCode.length() ? fileTransportCode : "DEVICE-OFFLINE-SCHEDULE-URL";
    lastDeviceErrorMessage = fileTransportMessage.length() ? fileTransportMessage : "離線排程 Slot URL 無法初始化";
    return false;
  }
  if (!addDeviceAuthorization(fileHttp, cfg)) {
    fileHttp.end();
    heap_caps_free(packed);
    return false;
  }
  const int fileStatus = countedHttpGet(fileHttp);
  if (handleDeviceAuthStatus(cfg, fileStatus)) {
    fileHttp.end();
    heap_caps_free(packed);
    return false;
  }
  const String fileContentType = fileHttp.header("Content-Type");
  if (fileStatus != HTTP_CODE_OK || fileHttp.getSize() != static_cast<int>(packedSize)
      || !fileContentType.startsWith("application/octet-stream")) {
    fileHttp.end();
    heap_caps_free(packed);
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-DOWNLOAD";
    lastDeviceErrorMessage = "離線排程 Slot HTTP／Content-Type／長度不合法";
    return false;
  }
  WiFiClient* stream = fileHttp.getStreamPtr();
  size_t total = 0U;
  const uint32_t started = millis();
  while (total < packedSize && millis() - started < 60000U) {
    const size_t available = stream->available();
    if (available == 0U) {
      if (!fileHttp.connected()) break;
      delay(1);
      continue;
    }
    const size_t count = min(available, packedSize - total);
    const int received = stream->read(packed + total, count);
    if (received > 0) {
      total += static_cast<size_t>(received);
      runtimeTelemetry.download_bytes += static_cast<uint32_t>(received);
    }
  }
  fileHttp.end();
  if (total != packedSize) {
    heap_caps_free(packed);
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-DOWNLOAD";
    lastDeviceErrorMessage = "離線排程 Slot Payload 未完整下載";
    return false;
  }
  unsigned char digest[32];
  if (calculateSha256(packed, packedSize, digest) != 0) {
    heap_caps_free(packed);
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-HASH";
    lastDeviceErrorMessage = "離線排程 Slot SHA-256 計算失敗";
    return false;
  }
  char actualSha[65];
  for (size_t index = 0; index < 32U; ++index) {
    snprintf(actualSha + index * 2U, 3U, "%02x", digest[index]);
  }
  actualSha[64] = '\0';
  if (!expectedSha.equalsIgnoreCase(String(actualSha))) {
    heap_caps_free(packed);
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-HASH";
    lastDeviceErrorMessage = "離線排程 Slot SHA-256 不一致";
    return false;
  }
  uint8_t* nativeFrame = nullptr;
  const bool converted = photoPainter.convertFrame(
    packed,
    packedSize,
    indexed4,
    rotation,
    &nativeFrame);
  heap_caps_free(packed);
  if (!converted || nativeFrame == nullptr) {
    lastDeviceErrorCode = "DEVICE-OFFLINE-FRAME";
    lastDeviceErrorMessage = "離線排程正式 Frame 轉換失敗";
    return false;
  }
  const bool written = photoPainter.writeFormalFrame(
    expectedSha.c_str(), rotation, nativeFrame, inktime::kPhotoPainterFrameBytes);
  heap_caps_free(nativeFrame);
  if (!written) {
    lastDeviceErrorCode = "DEVICE-OFFLINE-FRAME";
    lastDeviceErrorMessage = "離線排程正式 Frame 無法原子寫入 SD";
    return false;
  }
  return true;
}

static bool failOfflineScheduleTransaction(const String &message) {
  offlineScheduleTxnBlocked = true;
  lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-TXN";
  lastDeviceErrorMessage = message;
  return false;
}

