steven87090799/InkTime/esp32/ink-display-7C-photo/ink-display-7C-photo.ino
static bool commitActiveScheduleAndConfig(
  Config &cfg,
  const Config &candidate,
  const String &scheduleId,
  const String &scheduleJson,
  String &errorOut
) {
  errorOut = "";
  inktime::DeviceConfigStore::Prepared prepared;
  String persistError;
  if (!configStore.prepare(configPayload(candidate), prepared, persistError)) {
    errorOut = persistError;
    setConfigPersistenceError(persistError);
    return false;
  }
  recordNvsWrite();
  inktime::configstore::RecoveryJournal journal;
  journal.phase = inktime::configstore::JournalPhase::Prepared;
  journal.target_schedule_id = scheduleId.c_str();
  journal.previous_active_slot = prepared.previous_active_slot;
  journal.previous_generation = prepared.previous_generation;
  journal.prepared_slot = prepared.prepared_slot;
  journal.prepared_generation = prepared.prepared_generation;
  if (!configStore.writeJournal(journal, persistError)) {
    errorOut = persistError;
    setConfigPersistenceError(persistError);
    return false;
  }
  recordNvsWrite();
  if (!photoPainter.writeActiveSchedule(scheduleJson.c_str(), scheduleJson.length())
      || photoPainter.activeScheduleId() != scheduleId) {
    return failOfflineScheduleTransaction("離線排程 active schedule 寫入或身分驗證失敗");
  }
  journal.phase = inktime::configstore::JournalPhase::SchedulePromoted;
  if (!configStore.writeJournal(journal, persistError)) {
    errorOut = persistError;
    return failOfflineScheduleTransaction("離線排程 promotion journal 無法寫入");
  }
  recordNvsWrite();
  if (!configStore.commit(prepared, persistError)) {
    errorOut = persistError;
    return failOfflineScheduleTransaction("離線排程 Config A/B pointer 無法 commit");
  }
  recordNvsWrite();
  cfg = candidate;
  serverConfigChanged = true;
  offlineScheduleTxnBlocked = false;
  return true;
}

static bool downloadOfflineScheduleAndFrames(Config &cfg, bool targetNext = false) {
  if (offlineScheduleTxnBlocked) {
    return failOfflineScheduleTransaction("離線排程 transaction 尚未完成 recovery");
  }
  String base;
  if (cfg.backend_hostport.length() == 0 || !hasDeviceCredential(cfg)
      || !normalizedBackendBase(cfg, base)) {
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-CONFIG";
    lastDeviceErrorMessage = "離線排程缺少 Backend 或裝置 credential";
    return false;
  }
  if (!ensureWakeHttpSession(cfg, base)) return false;
  inktime::DeviceHttpTransport &scheduleTransport = wakeHttpTransport;
  HTTPClient scheduleHttp;
  String scheduleTransportCode;
  String scheduleTransportMessage;
  const char* scheduleHeaders[] = {"Content-Type"};
  scheduleHttp.collectHeaders(scheduleHeaders, 1);
  String schedulePath = DEVICE_OFFLINE_SCHEDULE_PATH;
  if (targetNext) schedulePath += "?target=next";
  if (!scheduleTransport.begin(
        scheduleHttp, base + schedulePath, 30000, scheduleTransportCode, scheduleTransportMessage)) {
    lastDeviceErrorCode = scheduleTransportCode.length() ? scheduleTransportCode : "DEVICE-OFFLINE-SCHEDULE-URL";
    lastDeviceErrorMessage = scheduleTransportMessage.length() ? scheduleTransportMessage : "離線排程 URL 無法初始化";
    return false;
  }
  if (!addDeviceAuthorization(scheduleHttp, cfg)) {
    scheduleHttp.end();
    return false;
  }
  const int status = countedHttpGet(scheduleHttp);
  if (handleDeviceAuthStatus(cfg, status)) {
    scheduleHttp.end();
    return false;
  }
  const int length = scheduleHttp.getSize();
  const String contentType = scheduleHttp.header("Content-Type");
  if (status == HTTP_CODE_CONFLICT && length > 0 && length <= 4096
      && contentType.startsWith("application/json")) {
    JsonDocument mismatch;
    const DeserializationError mismatchError = deserializeJson(mismatch, scheduleHttp.getStream());
    const String mismatchName = mismatch["error"] | "";
    const String mismatchCode = mismatch["error_code"] | "";
    scheduleHttp.end();
    if (!mismatchError && !mismatch.overflowed()
        && mismatchName == "delivery_mode_mismatch"
        && mismatchCode == "DEVICE-008") {
      offlineDeliveryModeMismatchDetected = true;
      lastDeviceErrorCode = "DEVICE-DELIVERY-MODE-MISMATCH";
      lastDeviceErrorMessage = "伺服器已切換 delivery_mode；本輪只執行一次 latest config convergence";
      return false;
    }
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-HTTP";
    lastDeviceErrorMessage = "離線排程 409 body 不是受信任的 delivery_mode_mismatch contract";
    return false;
  }
  if (status == HTTP_CODE_NOT_FOUND && length > 0 && length <= 4096
      && contentType.startsWith("application/json")) {
    JsonDocument notReady;
    const DeserializationError notReadyError = deserializeJson(notReady, scheduleHttp.getStream());
    scheduleHttp.end();
    const String errorName = notReady["error"] | "";
    const String notReadyTarget = notReady["target"] | "";
    const JsonVariantConst rawRetryEpoch = notReady["retry_after_epoch"];
    const JsonVariantConst rawNextSlotEpoch = notReady["next_slot_epoch"];
    int64_t serverRetryEpoch = 0;
    int64_t nextSlotEpoch = 0;
    bool nextSlotFieldValid = rawNextSlotEpoch.isNull();
    if (!notReadyError && !notReady.overflowed()
        && errorName == "schedule_not_ready"
        && ((targetNext && notReadyTarget == "next")
            || (!targetNext && (notReadyTarget.length() == 0U || notReadyTarget == "current")))
        && rawRetryEpoch.is<int64_t>() && !rawRetryEpoch.is<bool>()) {
      serverRetryEpoch = rawRetryEpoch.as<int64_t>();
    }
    if (!notReadyError && !notReady.overflowed()
        && errorName == "schedule_not_ready"
        && rawNextSlotEpoch.is<int64_t>() && !rawNextSlotEpoch.is<bool>()
        && rawNextSlotEpoch.as<int64_t>() > 0) {
      nextSlotEpoch = rawNextSlotEpoch.as<int64_t>();
      nextSlotFieldValid = true;
    }
    if (!nextSlotFieldValid) {
      serverRetryEpoch = 0;
      nextSlotEpoch = 0;
    }
    time_t recoveryNow = time(nullptr);
    if (recoveryNow <= 0) (void)photoPainter.readRtc(recoveryNow);
    if (errorName == "schedule_not_ready"
        && ((targetNext && notReadyTarget == "next")
            || (!targetNext && (notReadyTarget.length() == 0U || notReadyTarget == "current")))) {
      const time_t retryEpoch = scheduleOfflineRecovery(
        recoveryNow, serverRetryEpoch, nextSlotEpoch);
      lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-NOT-READY";
      lastDeviceErrorMessage = retryEpoch > recoveryNow
        ? "伺服器尚未準備今日離線排程；已保存 bounded retry epoch"
        : "伺服器尚未準備今日離線排程；時間無效，使用 bounded fallback";
      return false;
    }
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-HTTP";
    lastDeviceErrorMessage = "離線排程 schedule_not_ready JSON 不合法";
    return false;
  }
  if (status != HTTP_CODE_OK || length <= 0 || length > 32768
      || !contentType.startsWith("application/json")) {
    scheduleHttp.end();
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-HTTP";
    lastDeviceErrorMessage = "離線排程 HTTP／Content-Type／長度不合法";
    return false;
  }
  JsonDocument schedule;
  const DeserializationError jsonError = deserializeJson(schedule, scheduleHttp.getStream());
  scheduleHttp.end();
  const JsonVariantConst schema = schedule["schema_version"];
  const JsonVariantConst rawSlots = schedule["slots"];
  const String responseTarget = schedule["target"] | "current";
  const String deliveryMode = schedule["delivery_mode"] | "";
  const String targetLocalDate = schedule["target_local_date"] | "";
  const String targetDate = schedule["target_date"] | "";
  const String timezoneName = schedule["timezone"] | "";
  const String scheduleId = schedule["schedule_id"] | "";
  const String panelProfile = schedule["panel_profile"] | "";
  const String buttonWakeAction = schedule["button_wake_action"] | "";
  const String syncStrategy = schedule["sync_strategy"] | "first_display_lead";
  const String syncTime = schedule["sync_time"] | "";
  const JsonVariantConst rawConfigVersion = schedule["config_version"];
  const JsonVariantConst rawRotation = schedule["rotation"];
  const JsonVariantConst rawScheduleVersion = schedule["offline_schedule_version"];
  const JsonVariantConst rawTargetStartEpoch = schedule["target_start_epoch"];
  const JsonVariantConst rawTargetEndEpoch = schedule["target_end_epoch"];
  if (jsonError || schedule.overflowed() || responseTarget != (targetNext ? "next" : "current")
      || !schema.is<int32_t>() || schema.is<bool>()
      || schema.as<int32_t>() != 1 || deliveryMode != "inktime_offline_schedule"
      || !rawSlots.is<JsonArrayConst>() || targetLocalDate.length() == 0U
      || (targetDate.length() > 0U && targetDate != targetLocalDate)
      || timezoneName.length() == 0U || timezoneName.length() > 64U
      || scheduleId.length() == 0U
      || !inktime::boundedText(scheduleId.c_str(), inktime::kQueueIdentifierMaxBytes)
      || panelProfile.length() == 0U || !buttonWakeAction.length()
      || !validSyncStrategy(syncStrategy, syncTime)
      || !rawConfigVersion.is<uint32_t>() || rawConfigVersion.is<bool>()
      || !rawRotation.is<int32_t>() || rawRotation.is<bool>()
      || !rawScheduleVersion.is<int32_t>() || rawScheduleVersion.is<bool>()
      || rawScheduleVersion.as<int32_t>() < 0
      || !rawTargetStartEpoch.is<int64_t>() || rawTargetStartEpoch.is<bool>()
      || !rawTargetEndEpoch.is<int64_t>() || rawTargetEndEpoch.is<bool>()
      || rawTargetStartEpoch.as<int64_t>() <= 0
      || rawTargetEndEpoch.as<int64_t>() <= rawTargetStartEpoch.as<int64_t>()) {
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-SCHEMA";
    lastDeviceErrorMessage = "離線排程 schema、日期或快照欄位不相容";
    return false;
  }
  const JsonArrayConst slots = rawSlots.as<JsonArrayConst>();
  if (slots.size() == 0U || slots.size() > inktime::kMaxOfflineSlots) {
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-COUNT";
    lastDeviceErrorMessage = "離線排程 Slot 數量超過裝置上限";
    return false;
  }
  Config scheduleCandidate = cfg;
  JsonArrayConst rawTimes = schedule["schedule_times"].as<JsonArrayConst>();
  if (rawTimes.isNull()) rawTimes = schedule["schedule"].as<JsonArrayConst>();
  if (rawTimes.isNull() || rawTimes.size() == 0U
      || rawTimes.size() > inktime::kMaxOfflineSlots || rawTimes.size() != slots.size()) {
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-SCHEMA";
    lastDeviceErrorMessage = "離線排程 schedule_times 不合法";
    return false;
  }
  inktime::OfflineSlot scheduleSlots[inktime::kMaxOfflineSlots] = {};
  for (size_t index = 0; index < rawTimes.size(); ++index) {
    if (!parseOfflineClock(rawTimes[index] | "", scheduleSlots[index])) {
      lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-SCHEMA";
      lastDeviceErrorMessage = "離線排程時刻格式不合法";
      return false;
    }
  }
  if (!inktime::validateOfflineSlots(scheduleSlots, static_cast<uint8_t>(rawTimes.size()))) {
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-SCHEMA";
    lastDeviceErrorMessage = "離線排程時刻未排序或重複";
    return false;
  }
  time_t rtcEpoch = 0;
  if (!photoPainter.readRtc(rtcEpoch)) {
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-RTC";
    lastDeviceErrorMessage = "離線排程無法由 PhotoPainter RTC 驗證本地日期";
    return false;
  }
  const int64_t targetStartEpoch = rawTargetStartEpoch.as<int64_t>();
  const int64_t targetEndEpoch = rawTargetEndEpoch.as<int64_t>();
  int64_t activeTargetEndEpoch = 0;
  bool targetDateIsNext = false;
  String activeTargetDate;
  if (targetNext) {
    String activeJson;
    JsonDocument active;
    const bool activeReadable = photoPainter.readActiveSchedule(activeJson)
      && !deserializeJson(active, activeJson)
      && !active.overflowed();
    const JsonVariantConst activeEnd = active["target_end_epoch"];
    activeTargetDate = active["target_local_date"] | "";
    if (activeTargetDate.length() == 0U) activeTargetDate = active["target_date"] | "";
    String expectedNextDate;
    if (activeReadable && activeEnd.is<int64_t>() && !activeEnd.is<bool>()
        && activeEnd.as<int64_t>() > 0
        && nextIsoLocalDate(activeTargetDate, expectedNextDate)
        && targetLocalDate == expectedNextDate
        && targetStartEpoch == activeEnd.as<int64_t>()) {
      activeTargetEndEpoch = activeEnd.as<int64_t>();
      targetDateIsNext = true;
    }
    if (!targetDateIsNext || static_cast<int64_t>(rtcEpoch) >= targetStartEpoch) {
      lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-FUTURE";
      lastDeviceErrorMessage = "離線排程 next 快照不是目前 active 的下一個本地日";
      return false;
    }
  } else if (static_cast<int64_t>(rtcEpoch) < targetStartEpoch
             || static_cast<int64_t>(rtcEpoch) >= targetEndEpoch) {
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-RTC";
    lastDeviceErrorMessage = "離線排程 RTC 不在伺服器授權的目標本地日範圍";
    return false;
  }
  const uint32_t remoteConfigVersion = rawConfigVersion.as<uint32_t>();
  const int32_t remoteRotation = rawRotation.as<int32_t>();
  inktime::OfflineScheduleContract contract = {
    1,
    deliveryMode.c_str(),
    targetLocalDate.c_str(),
    targetLocalDate.c_str(),
    timezoneName.c_str(),
    targetStartEpoch,
    targetEndEpoch,
    static_cast<int64_t>(rtcEpoch),
    remoteConfigVersion,
    cfg.config_version,
    remoteRotation,
    panelProfile.c_str(),
    INKTIME_PANEL_PROFILE,
    buttonWakeAction.c_str(),
    static_cast<uint8_t>(slots.size()),
    static_cast<uint8_t>(rawTimes.size()),
    true,
    true,
    true,
  };
  inktime::OfflineNextScheduleContract nextContract = {
    1,
    deliveryMode.c_str(),
    targetLocalDate.c_str(),
    timezoneName.c_str(),
    targetStartEpoch,
    targetEndEpoch,
    activeTargetEndEpoch,
    static_cast<int64_t>(rtcEpoch),
    remoteConfigVersion,
    cfg.config_version,
    remoteRotation,
    panelProfile.c_str(),
    INKTIME_PANEL_PROFILE,
    buttonWakeAction.c_str(),
    static_cast<uint8_t>(slots.size()),
    static_cast<uint8_t>(rawTimes.size()),
    targetDateIsNext,
    true,
    true,
    true,
  };
  int64_t previousShowAtEpoch = 0;
  for (size_t index = 0; index < slots.size(); ++index) {
    const JsonVariantConst rawSlot = slots[index];
    if (!rawSlot.is<JsonObjectConst>()) {
      contract.queueIdentityValid = false;
      contract.sha256Valid = false;
      break;
    }
    const JsonObjectConst slot = rawSlot.as<JsonObjectConst>();
    const JsonVariantConst rawSize = slot["size"];
    const JsonVariantConst rawWidth = slot["width"];
    const JsonVariantConst rawHeight = slot["height"];
    const JsonVariantConst rawSlotIndex = slot["slot_index"];
    const JsonVariantConst rawQueueVersion = slot["queue_version"];
    const JsonVariantConst rawShowAtEpoch = slot["show_at_epoch"];
    const String itemId = slot["queue_item_id"] | "";
    const String releaseId = slot["release_id"] | "";
    const String slotScheduleId = slot["offline_schedule_id"] | "";
    const String sha = slot["sha256"] | "";
    const String downloadUrl = slot["download_url"] | "";
    const String pixelFormat = slot["pixel_format"] | "";
    const String renderProfile = slot["render_profile"] | "";
    const bool indexed4 = pixelFormat == "indexed4";
    const int64_t expectedSize = static_cast<int64_t>(FB_WIDTH) * FB_HEIGHT
      / (indexed4 ? 2 : 4);
    const bool validIdentity = rawSlot.is<JsonObjectConst>()
      && rawSlotIndex.is<int32_t>() && !rawSlotIndex.is<bool>()
      && rawSlotIndex.as<int32_t>() == static_cast<int32_t>(index)
      && rawQueueVersion.is<int32_t>() && !rawQueueVersion.is<bool>()
      && rawQueueVersion.as<int32_t>() >= 0
      && inktime::boundedText(itemId.c_str(), inktime::kQueueIdentifierMaxBytes)
      && inktime::boundedText(releaseId.c_str(), inktime::kQueueIdentifierMaxBytes)
      && inktime::boundedText(slotScheduleId.c_str(), inktime::kQueueIdentifierMaxBytes)
      && slotScheduleId == scheduleId
      && inktime::isSafeQueueDownloadPathForItem(
           downloadUrl.c_str(), downloadUrl.length(), itemId.c_str())
      && (renderProfile == "safe_4c" || renderProfile == String(INKTIME_PANEL_PROFILE));
    const bool validPayload = rawSize.is<int64_t>() && !rawSize.is<bool>()
      && rawSize.as<int64_t>() == expectedSize
      && rawWidth.is<int32_t>() && !rawWidth.is<bool>()
      && rawHeight.is<int32_t>() && !rawHeight.is<bool>()
      && rawWidth.as<int32_t>() == FB_WIDTH && rawHeight.as<int32_t>() == FB_HEIGHT
      && (pixelFormat == "indexed4" || pixelFormat == "2bpp")
      && inktime::isSha256Hex(sha.c_str());
    const bool validShowAtEpoch = rawShowAtEpoch.is<int64_t>() && !rawShowAtEpoch.is<bool>()
      && rawShowAtEpoch.as<int64_t>() >= targetStartEpoch
      && rawShowAtEpoch.as<int64_t>() < targetEndEpoch
      && (index == 0U || rawShowAtEpoch.as<int64_t>() > previousShowAtEpoch);
    contract.queueIdentityValid = contract.queueIdentityValid && validIdentity;
    contract.sha256Valid = contract.sha256Valid && validPayload;
    contract.slotEpochsValid = contract.slotEpochsValid && validShowAtEpoch;
    nextContract.queueIdentityValid = nextContract.queueIdentityValid && validIdentity;
    nextContract.sha256Valid = nextContract.sha256Valid && validPayload;
    nextContract.slotEpochsValid = nextContract.slotEpochsValid && validShowAtEpoch;
    if (validShowAtEpoch) previousShowAtEpoch = rawShowAtEpoch.as<int64_t>();
  }
  const bool validContract = targetNext
    ? inktime::validOfflineNextScheduleContract(nextContract)
    : inktime::validOfflineScheduleContract(contract);
  if (!validContract) {
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-SCHEMA";
    lastDeviceErrorMessage = "離線排程快照過期、日期錯誤或 Slot 完整性不合法";
    return false;
  }
  scheduleCandidate.schedule_count = static_cast<uint8_t>(rawTimes.size());
  for (uint8_t index = 0; index < scheduleCandidate.schedule_count; ++index) {
    scheduleCandidate.schedule_slots[index] = scheduleSlots[index];
  }
  scheduleCandidate.refresh_hour = scheduleSlots[0].hour;
  scheduleCandidate.refresh_minute = scheduleSlots[0].minute;
  scheduleCandidate.rotate180 = remoteRotation == 180;
  scheduleCandidate.delivery_mode = deliveryMode;
  scheduleCandidate.button_wake_action = buttonWakeAction;
  scheduleCandidate.sync_strategy = syncStrategy;
  scheduleCandidate.sync_time = syncTime;
  scheduleCandidate.config_version = remoteConfigVersion;
  const JsonVariantConst rawLead = schedule["prefetch_lead_minutes"];
  if (!rawLead.is<int32_t>() || rawLead.is<bool>()) {
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-SCHEMA";
    lastDeviceErrorMessage = "離線排程 prefetch_lead_minutes 缺少或型別不合法";
    return false;
  }
  const int remoteLead = rawLead.as<int32_t>();
  if (remoteLead < 0 || remoteLead > 120) {
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-SCHEMA";
    lastDeviceErrorMessage = "離線排程 prefetch_lead_minutes 不合法";
    return false;
  }
  scheduleCandidate.prefetch_lead_minutes = static_cast<uint16_t>(remoteLead);
  for (size_t index = 0; index < slots.size(); ++index) {
    const JsonVariantConst rawSlot = slots[index];
    if (!rawSlot.is<JsonObjectConst>()) {
      lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-ITEM";
      lastDeviceErrorMessage = "離線排程 Slot 必須是 JSON object";
      return false;
    }
    const JsonObjectConst slot = rawSlot.as<JsonObjectConst>();
    const JsonVariantConst rawSize = slot["size"];
    const JsonVariantConst rawWidth = slot["width"];
    const JsonVariantConst rawHeight = slot["height"];
    const JsonVariantConst rawSlotIndex = slot["slot_index"];
    const JsonVariantConst rawQueueVersion = slot["queue_version"];
    const JsonVariantConst rawShowAtEpoch = slot["show_at_epoch"];
    const String itemId = slot["queue_item_id"] | "";
    const String releaseId = slot["release_id"] | "";
    const String sha = slot["sha256"] | "";
    const String downloadUrl = slot["download_url"] | "";
    const String pixelFormat = slot["pixel_format"] | "";
    const String renderProfile = slot["render_profile"] | "";
    if (!rawSize.is<int64_t>() || rawSize.is<bool>()
        || !rawWidth.is<int32_t>() || rawWidth.is<bool>()
        || !rawHeight.is<int32_t>() || rawHeight.is<bool>()
        || !rawSlotIndex.is<int32_t>() || rawSlotIndex.is<bool>()
        || rawSlotIndex.as<int32_t>() != static_cast<int32_t>(index)
        || !rawQueueVersion.is<int32_t>() || rawQueueVersion.is<bool>()
        || rawQueueVersion.as<int32_t>() < 0
        || !rawShowAtEpoch.is<int64_t>() || rawShowAtEpoch.is<bool>()
        || rawShowAtEpoch.as<int64_t>() < targetStartEpoch
        || rawShowAtEpoch.as<int64_t>() >= targetEndEpoch
        || rawWidth.as<int32_t>() != FB_WIDTH || rawHeight.as<int32_t>() != FB_HEIGHT
        || !inktime::isSha256Hex(sha.c_str())
        || !inktime::boundedText(itemId.c_str(), inktime::kQueueIdentifierMaxBytes)
        || !inktime::boundedText(releaseId.c_str(), inktime::kQueueIdentifierMaxBytes)
        || !inktime::isSafeQueueDownloadPathForItem(
             downloadUrl.c_str(), downloadUrl.length(), itemId.c_str())
        || (renderProfile != "safe_4c" && renderProfile != String(INKTIME_PANEL_PROFILE))) {
      lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-ITEM";
      lastDeviceErrorMessage = "離線排程 Slot 身分、尺寸、SHA 或 Profile 不合法";
      return false;
    }
    currentFromQueue = true;
    currentQueueItemId = itemId;
    currentQueueVersion = rawQueueVersion.as<int32_t>();
    currentReleaseId = releaseId;
    currentRenderProfile = renderProfile;
    currentPayloadSha256 = sha;
    currentPayloadShaVerified = false;
    currentPayloadIntegrityTrusted = false;
    if (!sendQueueEvent(cfg, inktime::QueueEvent::ManifestReceived)
        || !sendQueueEvent(cfg, inktime::QueueEvent::DownloadStarted)
        || !downloadOfflineScheduleSlot(
             cfg,
             remoteRotation == 180
               ? inktime::DisplayRotation::Rotate180
               : inktime::DisplayRotation::Rotate0,
             base,
             downloadUrl,
             sha,
             pixelFormat,
             rawSize.as<int64_t>())
        || !sendQueueEvent(cfg, inktime::QueueEvent::DownloadCompleted)) {
      return false;
    }
    currentPayloadShaVerified = true;
    if (!sendQueueEvent(cfg, inktime::QueueEvent::HashVerified)) return false;
  }
  String scheduleJson;
  serializeJson(schedule, scheduleJson);
  if (targetNext) {
    const bool stored = photoPainter.writeStagedNextSchedule(
      scheduleJson.c_str(), scheduleJson.length());
    if (!stored || photoPainter.stagedNextScheduleId() != scheduleId) {
      lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-STAGE";
      lastDeviceErrorMessage = "離線排程 staged next 無法原子寫入或身分驗證失敗";
      return false;
    }
    // The future snapshot remains a staged artifact.  Its rotation, schedule,
    // lead and config version are not applied until the target local midnight.
    currentFromQueue = false;
    currentPayloadIntegrityTrusted = true;
    return true;
  }
  String persistError;
  if (!commitActiveScheduleAndConfig(
        cfg, scheduleCandidate, scheduleId, scheduleJson, persistError)) {
    if (persistError.length() > 0U) setConfigPersistenceError(persistError);
    return false;
  }
  clearOfflineRetryState();
  currentFromQueue = false;
  currentPayloadIntegrityTrusted = true;
  return true;
}

static bool reconcilePendingScheduleConfigTransaction(Config &cfg) {
  inktime::configstore::RecoveryJournal journal;
  bool present = false;
  String journalError;
  if (!configStore.readJournal(journal, present, journalError)) {
    return failOfflineScheduleTransaction("離線排程 recovery journal 損壞，已 fail-closed");
  }
  if (!present) return true;

