steven87090799/InkTime/esp32/ink-display-7C-photo/ink-display-7C-photo.ino
  const bool indexed4 = selectedPixelFormat == "indexed4";
  const size_t packedSize = static_cast<size_t>(FB_WIDTH) * FB_HEIGHT / (indexed4 ? 2U : 4U);
  if (selectedSize != static_cast<int64_t>(packedSize)) {
    lastDeviceErrorCode = "DEVICE-QUEUE-SIZE";
    lastDeviceErrorMessage = "Queue Payload size 與 pixel format 不一致";
    return QueueDownloadResult::Failed;
  }

  uint8_t* packed = nullptr;
#if INKTIME_PHOTOPAINTER_ENABLED
  packed = photoPainter.allocateWireBuffer(packedSize);
#else
  packed = static_cast<uint8_t*>(heap_caps_malloc(packedSize, MALLOC_CAP_8BIT | MALLOC_CAP_SPIRAM));
  if (!packed) packed = static_cast<uint8_t*>(heap_caps_malloc(packedSize, MALLOC_CAP_8BIT));
#endif
  if (!packed) {
    lastDeviceErrorCode = "DEVICE-MEMORY";
    lastDeviceErrorMessage = "無法配置 Queue 下載緩衝區";
    return QueueDownloadResult::Failed;
  }
  if (!sendQueueEvent(cfg, inktime::QueueEvent::DownloadStarted)) {
    heap_caps_free(packed);
    return QueueDownloadResult::Failed;
  }

  inktime::DeviceHttpTransport &fileTransport = wakeHttpTransport;
  HTTPClient fileHttp;
  String fileTransportCode;
  String fileTransportMessage;
  const char* fileHeaders[] = {"Content-Type"};
  fileHttp.collectHeaders(fileHeaders, 1);
  if (!fileTransport.begin(
        fileHttp, base + selectedDownloadUrl, 60000, fileTransportCode, fileTransportMessage)) {
    heap_caps_free(packed);
    lastDeviceErrorCode = fileTransportCode.length() ? fileTransportCode : "DEVICE-QUEUE-FILE-URL";
    lastDeviceErrorMessage = fileTransportMessage.length() ? fileTransportMessage : "Queue download URL 無法初始化";
    return QueueDownloadResult::Failed;
  }
  if (!addDeviceAuthorization(fileHttp, cfg)) {
    fileHttp.end();
    heap_caps_free(packed);
    return QueueDownloadResult::Failed;
  }
  const int fileStatus = countedHttpGet(fileHttp);
  if (handleDeviceAuthStatus(cfg, fileStatus)) {
    fileHttp.end();
    heap_caps_free(packed);
    return QueueDownloadResult::Failed;
  }
  const String fileContentType = fileHttp.header("Content-Type");
  if (fileStatus != HTTP_CODE_OK || fileHttp.getSize() != static_cast<int>(packedSize)
      || !fileContentType.startsWith("application/octet-stream")) {
    fileHttp.end();
    heap_caps_free(packed);
    lastDeviceErrorCode = "DEVICE-QUEUE-DOWNLOAD";
    lastDeviceErrorMessage = "Queue download HTTP／Content-Type／長度不合法";
    return QueueDownloadResult::Failed;
  }
  WiFiClient* stream = fileHttp.getStreamPtr();
  size_t total = 0U;
  const uint32_t started = millis();
  while (total < packedSize && millis() - started < 60000U) {
    const size_t available = stream->available();
    if (available == 0U) {
      if (!fileHttp.connected()) break;
      delay(1);
      continue;
    }
    const size_t count = min(available, packedSize - total);
    const int received = stream->read(packed + total, count);
    if (received > 0) {
      total += static_cast<size_t>(received);
      runtimeTelemetry.download_bytes += static_cast<uint32_t>(received);
    }
  }
  fileHttp.end();
  if (total != packedSize) {
    heap_caps_free(packed);
    lastDeviceErrorCode = "DEVICE-QUEUE-DOWNLOAD";
    lastDeviceErrorMessage = "Queue Payload 未完整下載";
    return QueueDownloadResult::Failed;
  }
  if (!sendQueueEvent(cfg, inktime::QueueEvent::DownloadCompleted)) {
    heap_caps_free(packed);
    return QueueDownloadResult::Failed;
  }

  unsigned char digest[32];
  if (calculateSha256(packed, packedSize, digest) != 0) {
    heap_caps_free(packed);
    lastDeviceErrorCode = "DEVICE-QUEUE-HASH";
    lastDeviceErrorMessage = "Queue Payload SHA-256 計算失敗";
    return QueueDownloadResult::Failed;
  }
  char actualSha[65];
  for (size_t index = 0; index < 32U; ++index) {
    snprintf(actualSha + index * 2U, 3U, "%02x", digest[index]);
  }
  actualSha[64] = '\0';
  if (!selectedSha.equalsIgnoreCase(String(actualSha))) {
    heap_caps_free(packed);
    lastDeviceErrorCode = "DEVICE-QUEUE-HASH";
    lastDeviceErrorMessage = "Queue Payload SHA-256 不一致";
    return QueueDownloadResult::Failed;
  }
  currentPayloadShaVerified = true;
  if (!sendQueueEvent(cfg, inktime::QueueEvent::HashVerified)) {
    heap_caps_free(packed);
    return QueueDownloadResult::Failed;
  }

  if (frameData) heap_caps_free(frameData);
#if INKTIME_PHOTOPAINTER_ENABLED
  const uint32_t sourceHash = inktime::sourceHash32(selectedSha.c_str());
  const inktime::DisplayRotation rotation = cfg.rotate180
    ? inktime::DisplayRotation::Rotate180
    : inktime::DisplayRotation::Rotate0;
  uint8_t* nativeFrame = nullptr;
  if (!photoPainter.loadCachedFrame(sourceHash, rotation, &nativeFrame, selectedSha.c_str())
      && !photoPainter.convertAndCache(
        packed, packedSize, indexed4, sourceHash, rotation, &nativeFrame, selectedSha.c_str())) {
    heap_caps_free(packed);
    frameData = nullptr;
    lastDeviceErrorCode = photoPainter.lastError();
    lastDeviceErrorMessage = "PhotoPainter Queue framebuffer 轉換失敗";
    return QueueDownloadResult::Failed;
  }
  heap_caps_free(packed);
  frameData = nativeFrame;
  frameDataSize = inktime::kPhotoPainterFrameBytes;
  frameIndexed4 = true;
  frameNativePalette = true;
  if (enhancedOffline && !photoPainter.writeFormalFrame(
        selectedSha.c_str(), rotation, nativeFrame, inktime::kPhotoPainterFrameBytes)) {
    heap_caps_free(nativeFrame);
    frameData = nullptr;
    frameDataSize = 0;
    lastDeviceErrorCode = "DEVICE-OFFLINE-FRAME";
    lastDeviceErrorMessage = "Enhanced Formal Frame 無法原子寫入 SD";
    return QueueDownloadResult::Failed;
  }
#else
  frameData = packed;
  frameDataSize = packedSize;
  frameIndexed4 = indexed4;
  frameNativePalette = false;
#endif
  currentPayloadIntegrityTrusted = true;
  currentDisplaySkipped = shouldSkipCurrentDisplay(cfg);
  return QueueDownloadResult::Used;
}

#if INKTIME_PHOTOPAINTER_ENABLED
static bool activeOfflineEpochs(
  time_t nowEpoch,
  time_t &nextDisplayEpoch,
  time_t &targetEndEpoch,
  time_t &nextSchedulePrefetchEpoch
) {
  nextDisplayEpoch = 0;
  targetEndEpoch = 0;
  nextSchedulePrefetchEpoch = 0;
  String activeJson;
  if (!photoPainter.readActiveSchedule(activeJson)) return false;
  JsonDocument active;
  if (deserializeJson(active, activeJson) || active.overflowed()) return false;
  const JsonVariantConst rawEnd = active["target_end_epoch"];
  const JsonVariantConst rawPrefetch = active["next_schedule_prefetch_epoch"];
  const JsonVariantConst rawSlots = active["slots"];
  const String syncStrategy = active["sync_strategy"] | "first_display_lead";
  const String syncTime = active["sync_time"] | "";
  if (!rawEnd.is<int64_t>() || rawEnd.is<bool>() || rawEnd.as<int64_t>() <= 0
      || !rawSlots.is<JsonArrayConst>()
      || !validSyncStrategy(syncStrategy, syncTime)) return false;
  if (!rawPrefetch.isNull()
      && (!rawPrefetch.is<int64_t>() || rawPrefetch.is<bool>() || rawPrefetch.as<int64_t>() < 0)) {
    return false;
  }
  targetEndEpoch = static_cast<time_t>(rawEnd.as<int64_t>());
  if (!rawPrefetch.isNull()) {
    nextSchedulePrefetchEpoch = static_cast<time_t>(rawPrefetch.as<int64_t>());
  }
  const JsonArrayConst slots = rawSlots.as<JsonArrayConst>();
  for (size_t index = 0; index < slots.size(); ++index) {
    const JsonVariantConst rawSlot = slots[index];
    if (!rawSlot.is<JsonObjectConst>()) return false;
    const JsonVariantConst rawShowAt = rawSlot["show_at_epoch"];
    if (!rawShowAt.is<int64_t>() || rawShowAt.is<bool>() || rawShowAt.as<int64_t>() <= 0) {
      return false;
    }
    const time_t showAt = static_cast<time_t>(rawShowAt.as<int64_t>());
    if (showAt > nowEpoch && (nextDisplayEpoch == 0 || showAt < nextDisplayEpoch)) {
      nextDisplayEpoch = showAt;
    }
  }
  return true;
}

static bool validatedActiveScheduleVersion(
    const Config& cfg, time_t nowEpoch, uint32_t& versionOut) {
  versionOut = 0U;
  String activeJson;
  if (!photoPainter.readActiveSchedule(activeJson)) return false;
  JsonDocument active;
  const DeserializationError jsonError = deserializeJson(active, activeJson);
  const JsonVariantConst rawSlots = active["slots"];
  String targetDate = active["target_local_date"] | "";
  if (targetDate.length() == 0U) targetDate = active["target_date"] | "";
  const String activeTargetDate = active["target_local_date"] | "";
  const String activeLegacyDate = active["target_date"] | "";
  const String activeDeliveryMode = active["delivery_mode"] | "";
  const String activeTimezone = active["timezone"] | "";
  const String activeScheduleId = active["schedule_id"] | "";
  const String activePanelProfile = active["panel_profile"] | "";
  const String activeButtonWakeAction = active["button_wake_action"] | "";
  const String activeSyncStrategy = active["sync_strategy"] | "first_display_lead";
  const String activeSyncTime = active["sync_time"] | "";
  const JsonVariantConst activeSchema = active["schema_version"];
  const JsonVariantConst activeConfigVersion = active["config_version"];
  const JsonVariantConst activeRotation = active["rotation"];
  const JsonVariantConst activeScheduleVersion = active["offline_schedule_version"];
  const JsonVariantConst activeTargetStartEpoch = active["target_start_epoch"];
  const JsonVariantConst activeTargetEndEpoch = active["target_end_epoch"];
  if (jsonError || active.overflowed() || !rawSlots.is<JsonArrayConst>()
      || targetDate.length() != 10U || activeTargetDate.length() == 0U
      || (activeLegacyDate.length() > 0U && activeLegacyDate != activeTargetDate)
      || !activeSchema.is<int32_t>() || activeSchema.is<bool>()
      || activeSchema.as<int32_t>() != inktime::kOfflineScheduleSchemaVersion
      || activeDeliveryMode != "inktime_offline_schedule"
      || activeTimezone.length() == 0U || activeTimezone.length() > 64U
      || activeScheduleId.length() == 0U || !inktime::boundedText(
        activeScheduleId.c_str(), inktime::kQueueIdentifierMaxBytes)
      || !validSyncStrategy(activeSyncStrategy, activeSyncTime)
      || !activeConfigVersion.is<uint32_t>() || activeConfigVersion.is<bool>()
      || !activeRotation.is<int32_t>() || activeRotation.is<bool>()
      || !activeScheduleVersion.is<int32_t>() || activeScheduleVersion.is<bool>()
      || activeScheduleVersion.as<int32_t>() < 0
      || !activeTargetStartEpoch.is<int64_t>() || activeTargetStartEpoch.is<bool>()
      || !activeTargetEndEpoch.is<int64_t>() || activeTargetEndEpoch.is<bool>()
      || activeTargetStartEpoch.as<int64_t>() <= 0
      || activeTargetEndEpoch.as<int64_t>() <= activeTargetStartEpoch.as<int64_t>()
      || nowEpoch <= 0) {
    return false;
  }
  const int64_t targetStartEpoch = activeTargetStartEpoch.as<int64_t>();
  const int64_t targetEndEpoch = activeTargetEndEpoch.as<int64_t>();
  if (static_cast<int64_t>(nowEpoch) < targetStartEpoch
      || static_cast<int64_t>(nowEpoch) >= targetEndEpoch) return false;

  const JsonArrayConst slots = rawSlots.as<JsonArrayConst>();
  JsonArrayConst rawTimes = active["schedule_times"].as<JsonArrayConst>();
  if (rawTimes.isNull()) rawTimes = active["schedule"].as<JsonArrayConst>();
  if (rawTimes.isNull() || rawTimes.size() == 0U
      || rawTimes.size() > inktime::kMaxOfflineSlots || rawTimes.size() != slots.size()) {
    return false;
  }
  inktime::OfflineSlot activeScheduleSlots[inktime::kMaxOfflineSlots] = {};
  for (size_t index = 0; index < rawTimes.size(); ++index) {
    if (!parseOfflineClock(rawTimes[index] | "", activeScheduleSlots[index])) return false;
  }
  if (!inktime::validateOfflineSlots(
        activeScheduleSlots, static_cast<uint8_t>(rawTimes.size()))
      || rawTimes.size() != cfg.schedule_count
      || !inktime::validateOfflineSlots(cfg.schedule_slots, cfg.schedule_count)) {
    return false;
  }
  for (uint8_t index = 0; index < cfg.schedule_count; ++index) {
    if (activeScheduleSlots[index].hour != cfg.schedule_slots[index].hour
        || activeScheduleSlots[index].minute != cfg.schedule_slots[index].minute) {
      return false;
    }
  }
  inktime::OfflineScheduleContract contract = {
    activeSchema.as<int32_t>(),
    activeDeliveryMode.c_str(),
    activeTargetDate.c_str(),
    activeTargetDate.c_str(),
    activeTimezone.c_str(),
    targetStartEpoch,
    targetEndEpoch,
    static_cast<int64_t>(nowEpoch),
    activeConfigVersion.as<uint32_t>(),
    cfg.config_version,
    activeRotation.as<int32_t>(),
    activePanelProfile.c_str(),
    INKTIME_PANEL_PROFILE,
    activeButtonWakeAction.c_str(),
    static_cast<uint8_t>(slots.size()),
    static_cast<uint8_t>(rawTimes.size()),
    true,
    true,
    true,
  };
  if (activeConfigVersion.as<uint32_t>() != cfg.config_version
      || !inktime::validOfflineScheduleContract(contract)
      || cfg.delivery_mode != "inktime_offline_schedule"
      || cfg.rotate180 != (activeRotation.as<int32_t>() == 180)) {
    return false;
  }

  int64_t previousShowAtEpoch = 0;
  for (size_t index = 0U; index < slots.size(); ++index) {
    const JsonVariantConst rawSlot = slots[index];
    if (!rawSlot.is<JsonObjectConst>()) return false;
    const JsonObjectConst slot = rawSlot.as<JsonObjectConst>();
    const JsonVariantConst rawIndex = slot["slot_index"];
    const JsonVariantConst rawQueueVersion = slot["queue_version"];
    const JsonVariantConst rawShowAt = slot["show_at_epoch"];
    const String slotScheduleId = slot["offline_schedule_id"] | "";
    const String queueItemId = slot["queue_item_id"] | "";
    const String releaseId = slot["release_id"] | "";
    const String sha = slot["sha256"] | "";
    const String renderProfile = slot["render_profile"] | "";
    if (!rawIndex.is<int32_t>() || rawIndex.is<bool>()
        || rawIndex.as<int32_t>() != static_cast<int32_t>(index)
        || !rawQueueVersion.is<int32_t>() || rawQueueVersion.is<bool>()
        || rawQueueVersion.as<int32_t>() < 0
        || !rawShowAt.is<int64_t>() || rawShowAt.is<bool>()
        || rawShowAt.as<int64_t>() < targetStartEpoch
        || rawShowAt.as<int64_t>() >= targetEndEpoch
        || (index > 0U && rawShowAt.as<int64_t>() <= previousShowAtEpoch)
        || slotScheduleId != activeScheduleId
        || !inktime::boundedText(queueItemId.c_str(), inktime::kQueueIdentifierMaxBytes)
        || !inktime::boundedText(releaseId.c_str(), inktime::kQueueIdentifierMaxBytes)
        || !inktime::isSha256Hex(sha.c_str())
        || (renderProfile != "safe_4c" && renderProfile != String(INKTIME_PANEL_PROFILE))) {
      return false;
    }
    previousShowAtEpoch = rawShowAt.as<int64_t>();
  }
  versionOut = static_cast<uint32_t>(activeScheduleVersion.as<int32_t>());
  return true;
}

static time_t fixedDailySyncEpoch(const String& syncTime, time_t nowEpoch) {
  if (!validSyncTime(syncTime) || syncTime.isEmpty() || nowEpoch <= 0) return 0;
  struct tm localNow = {};
  localtime_r(&nowEpoch, &localNow);
  struct tm candidate = localNow;
  candidate.tm_hour = syncTime.substring(0, 2).toInt();
  candidate.tm_min = syncTime.substring(3, 5).toInt();
  candidate.tm_sec = 0;
  time_t candidateEpoch = mktime(&candidate);
  if (candidateEpoch <= nowEpoch) {
    candidate.tm_mday += 1;
    candidateEpoch = mktime(&candidate);
  }
  return candidateEpoch > nowEpoch ? candidateEpoch : 0;
}

