steven87090799/InkTime/esp32/ink-display-7C-photo/ink-display-7C-photo.ino
#if !INKTIME_PHOTOPAINTER_ENABLED
static bool displayPairingCode(const Config &cfg, const String &pairingCode) {
  initDisplay(cfg);
  const uint32_t refreshStarted = millis();
  display.setFullWindow();
  display.firstPage();
  do {
    display.fillScreen(GxEPD_WHITE);
    display.setTextColor(GxEPD_BLACK);
    display.setTextSize(2);
    display.setCursor(20, 90);
    display.print("INKTIME PAIRING");
    display.setCursor(20, 180);
    display.print("CODE:");
    display.setCursor(20, 235);
    display.setTextSize(4);
    display.print(pairingCode);
    display.setTextSize(2);
    display.setCursor(20, 330);
    display.print("VALID 5 MIN");
  } while (display.nextPage());
  display.hibernate();
  lastRefreshDurationMs = millis() - refreshStarted;
  return true;
}
#endif

bool drawFromFrameData(const Config &cfg) {
  (void)cfg;

#if INKTIME_PHOTOPAINTER_ENABLED
  if (!frameNativePalette || frameDataSize != inktime::kPhotoPainterFrameBytes) return false;
  const bool updated = photoPainter.displayFrame(frameData, frameDataSize);
  lastRefreshDurationMs = photoPainter.lastRefreshDurationMs();
  runtimeTelemetry.epd_transfer_ms = lastRefreshDurationMs;
  return updated;
#else

  const uint32_t refreshStarted = millis();
  display.setFullWindow();
  int w = display.width();   // 480
  int h = display.height();  // 800

#if DEBUG_LOG
  DBG_PRINT("[EPD] logical w="); DBG_PRINT(w);
  DBG_PRINT(" h="); DBG_PRINTLN(h);
#endif

  display.firstPage();
  do {
    for (int y = 0; y < FB_HEIGHT && y < h; ++y) {
      for (int x = 0; x < FB_WIDTH && x < w; ++x) {
        size_t pixel = (size_t)y * FB_WIDTH + x;
        uint8_t packed = frameData[pixel / (frameIndexed4 ? 2 : 4)];
        uint8_t c = frameIndexed4
          ? ((pixel % 2 == 0) ? (packed >> 4) : (packed & 0x0F))
          : ((packed >> (6 - (pixel % 4) * 2)) & 0x03);
        uint16_t col;
        if (frameIndexed4) {
          switch (c) {
            case 0: col = GxEPD_BLACK;  break;
            case 1: col = GxEPD_WHITE;  break;
            case 2: col = GxEPD_GREEN;  break;
            case 3: col = GxEPD_BLUE;   break;
            case 4: col = GxEPD_RED;    break;
            case 5: col = GxEPD_YELLOW; break;
            case 6: col = GxEPD_ORANGE; break;
            default: col = GxEPD_WHITE; break;
          }
        } else {
          switch (c) {
            case 0: col = GxEPD_BLACK;  break;
            case 1: col = GxEPD_WHITE;  break;
            case 2: col = GxEPD_RED;    break;
            case 3: col = GxEPD_YELLOW; break;
            default: col = GxEPD_WHITE; break;
          }
        }
        display.drawPixel(x, y, col);
      }
    }
  } while (display.nextPage());

  lastRefreshDurationMs = millis() - refreshStarted;
  runtimeTelemetry.epd_transfer_ms = lastRefreshDurationMs;
  display.hibernate();
  return true;
#endif
}

// =======================
//  睡到下一个唤醒点
// =======================
void sleepUntilNextSchedule(const Config &cfg, bool hasTime, const struct tm &now) {
#if INKTIME_PHOTOPAINTER_ENABLED
  if (offlineScheduleTxnBlocked) {
    goDeepSleepSeconds(inktime::kOfflineRetryFirstSeconds);
    return;
  }
  if (cfg.delivery_mode == "inktime_offline_schedule") {
    if (!hasTime) {
      // Unknown time is a bounded recovery wake, never a 24-hour blind sleep.
      goDeepSleepSeconds(inktime::kOfflineRetryFirstSeconds);
      return;
    }
    time_t nowEpoch = time(nullptr);
    if (nowEpoch <= 0) {
      time_t rtcEpoch = 0;
      if (photoPainter.readRtc(rtcEpoch)) nowEpoch = rtcEpoch;
    }
    if (nowEpoch > 0) {
      time_t nextDisplay = 0;
      time_t targetEnd = 0;
      time_t nextSchedulePrefetch = 0;
      if (activeOfflineEpochs(nowEpoch, nextDisplay, targetEnd, nextSchedulePrefetch)) {
        time_t wakeEpoch = 0;
        const auto considerWake = [&wakeEpoch, nowEpoch](time_t candidate) {
          if (candidate > nowEpoch && (wakeEpoch == 0 || candidate < wakeEpoch)) {
            wakeEpoch = candidate;
          }
        };
        if (nextDisplay > nowEpoch) {
          const uint64_t leadSeconds = static_cast<uint64_t>(cfg.prefetch_lead_minutes) * 60ULL;
          const time_t prefetchEpoch = nextDisplay > static_cast<time_t>(leadSeconds)
            ? nextDisplay - static_cast<time_t>(leadSeconds)
            : nextDisplay;
          considerWake(prefetchEpoch > nowEpoch ? prefetchEpoch : nextDisplay);
        }
        // The next schedule's server/IANA-computed technical deadline is an
        // independent wake candidate and may occur before today's end.
        considerWake(nextSchedulePrefetch);
        considerWake(targetEnd);
        String syncStrategy;
        String syncTime;
        if (runtimeSyncFields(cfg, syncStrategy, syncTime)
            && syncStrategy == "fixed_daily") {
          considerWake(fixedDailySyncEpoch(syncTime, nowEpoch));
        }
        uint8_t retryAttempt = 0;
        int64_t retryEpoch = 0;
        int64_t retryNextSlot = 0;
        if (loadOfflineRetryState(retryAttempt, retryEpoch, retryNextSlot)
            && inktime::validOfflineRetryEpoch(
              static_cast<uint64_t>(nowEpoch), retryEpoch, retryNextSlot)) {
          considerWake(static_cast<time_t>(retryEpoch));
        }
        if (wakeEpoch > nowEpoch) {
          goDeepSleepUntilEpoch(nowEpoch, wakeEpoch);
          return;
        }
        // An exhausted day uses the same persisted bounded recovery plan as
        // a missing schedule, instead of a one-minute storm.
        const time_t recoveryEpoch = scheduleOfflineRecovery(nowEpoch);
        if (recoveryEpoch > nowEpoch) goDeepSleepUntilEpoch(nowEpoch, recoveryEpoch);
        else goDeepSleepSeconds(inktime::kOfflineRetryFirstSeconds);
        return;
      }
      const time_t recoveryEpoch = scheduleOfflineRecovery(nowEpoch);
      if (recoveryEpoch > nowEpoch) goDeepSleepUntilEpoch(nowEpoch, recoveryEpoch);
      else goDeepSleepSeconds(inktime::kOfflineRetryFirstSeconds);
      return;
    }
    goDeepSleepSeconds(inktime::kOfflineRetryFirstSeconds);
    return;
  }
#endif
  if (!hasTime) {
    goDeepSleepMinutes(1440);
    return;
  }

