steven87090799/InkTime/esp32/ink-display-7C-photo/ink-display-7C-photo.ino
  if (isFactoryResetRequestedAtBoot()) {
#if DEBUG_LOG
  DBG_PRINT("[BOOT] factory reset GPIO=");
  DBG_PRINTLN((int)kBoardConfig.buttons.factoryReset);
#endif
  clearConfigNVS();

  WiFi.disconnect(true, true);
  WiFi.mode(WIFI_OFF);
  esp_wifi_stop();
  delay(200);
}

  randomSeed(esp_random());

#if INKTIME_PHOTOPAINTER_ENABLED
  if (!photoPainter.begin()) {
    lastDeviceErrorCode = photoPainter.lastError();
    lastDeviceErrorMessage = "PhotoPainter Flash／OPI PSRAM 不存在或容量不足";
  }
#endif

  loadConfig(g_cfg);

  if (g_cfg.valid) {
    struct tm bootTime = {};
    (void)seedTimeFromRtc(g_cfg, bootTime);
  }

#if INKTIME_PHOTOPAINTER_ENABLED
  const bool offlineTxnRecovered = reconcilePendingScheduleConfigTransaction(g_cfg);
  if (offlineTxnRecovered && g_cfg.delivery_mode == "inktime_offline_schedule") {
    time_t bootRtcEpoch = 0;
    if (photoPainter.readRtc(bootRtcEpoch) && bootRtcEpoch > 0) {
      applyFixedTimezoneWithoutNtp(g_cfg.tz_offset_minutes);
      struct timeval value = {bootRtcEpoch, 0};
      settimeofday(&value, nullptr);
      // Reliable RTC time is the authority for the local-midnight boundary;
      // promote a fully validated staged-next snapshot before any local or
      // network display decision is made.
      (void)promoteStagedNextIfDue(g_cfg, bootRtcEpoch);
    }
  }
#endif

#if INKTIME_PHOTOPAINTER_ENABLED
  runFormalFrameGcForWake();
#endif

  if (!g_cfg.valid) {
#if DEBUG_LOG
    DBG_PRINTLN("[BOOT] no valid config -> AP portal");
#endif
    startConfigPortal();
  }

#if INKTIME_PHOTOPAINTER_ENABLED
  const esp_sleep_wakeup_cause_t wakeCause = esp_sleep_get_wakeup_cause();
  const bool timerWake = wakeCause == ESP_SLEEP_WAKEUP_TIMER;
  if (!offlineScheduleTxnBlocked && g_cfg.auth_state == "paired" && !deviceAuthInvalid
      && g_cfg.delivery_mode == "inktime_offline_schedule"
      && photoPainter.wokeFromUserButton()
      && g_cfg.button_wake_action == "local_next") {
    // local_next is a strict cache-only action.  It must not connect Wi-Fi or
    // ask the generic queue for its first item.
    runOfflineLocalCycle(true);
    return;
  }
  if (!offlineScheduleTxnBlocked && g_cfg.auth_state == "paired" && !deviceAuthInvalid
      && g_cfg.delivery_mode == "inktime_offline_schedule" && timerWake
      && !photoPainter.forceNetworkRefresh()) {
    time_t rtcEpoch = 0;
    if (!photoPainter.readRtc(rtcEpoch)) {
      runOfflineLocalCycle();
      return;
    }
    applyFixedTimezoneWithoutNtp(g_cfg.tz_offset_minutes);
    struct timeval value = {rtcEpoch, 0};
    settimeofday(&value, nullptr);
    const bool networkWake = offlinePrefetchWake(g_cfg, rtcEpoch)
      || offlineFixedDailySyncDue(g_cfg, rtcEpoch);
    if (!networkWake) {
      runOfflineLocalCycle();
      return;
    }
    enhancedNetworkWakeRequested = true;
  }
#endif

  if ((g_cfg.auth_state == "auth_invalid" || g_cfg.auth_state == "revoked")
      && !pairingRetryDue(g_cfg)) {
    goDeepSleepSeconds(pairingBackoffSeconds(g_cfg));
    return;
  }

#if DEBUG_LOG
  DBG_PRINTLN("[BOOT] have config -> connect WiFi");
#endif
  networkSessionStartedMs = millis();
  if (!connectWiFi(g_cfg)) {
#if DEBUG_LOG
    DBG_PRINTLN("[BOOT] connect failed");
#endif
#if INKTIME_PHOTOPAINTER_ENABLED
    // Known battery power must not remain in a network retry/configuration loop.
    // USB keeps the bounded service path available; an unidentified PMIC must
    // not fall through into a long AP portal on every unattended wake.
    photoPainter.refreshPowerState();
    if (!photoPainter.powerSourceKnown() && !photoPainter.usbConnected()) {
      lastDeviceErrorCode = "DEVICE-POWER-UNKNOWN";
      lastDeviceErrorMessage = "PMIC／電池來源未知，已跳過 AP portal 並等待 bounded recovery wake";
      goDeepSleepSeconds(300U);
      return;
    }
    if (photoPainter.powerSourceKnown() && !photoPainter.usbConnected()) {
      applyFixedTimezoneWithoutNtp(g_cfg.tz_offset_minutes);
      time_t rtcEpoch = 0;
      struct tm offlineTime = {};
      bool hasOfflineTime = photoPainter.readRtc(rtcEpoch);
      if (hasOfflineTime) {
        struct timeval value = {rtcEpoch, 0};
        settimeofday(&value, nullptr);
        localtime_r(&rtcEpoch, &offlineTime);
      }
      if (!offlineScheduleTxnBlocked && g_cfg.delivery_mode == "inktime_offline_schedule" && hasOfflineTime
          && activeHasDueFormalSlot(rtcEpoch)) {
        // A due 00:00/current formal slot is serviceable from the active
        // cache even when the midnight network recovery attempt fails.
        runOfflineLocalCycle();
        return;
      }
      lastDeviceErrorCode = "DEVICE-WIFI-TIMEOUT";
      lastDeviceErrorMessage = "電池模式 Wi-Fi 逾時，已停止重試";
      sleepUntilNextSchedule(g_cfg, hasOfflineTime, offlineTime);
    }
#endif
    DBG_PRINTLN("[BOOT] enter bounded AP portal");
    startConfigPortal();
  }

  // Pairing is a one-time authorization flow, never part of an ordinary
  // credentialed wake.  A revoked/invalid credential may re-enter this flow
  // only after a dedicated authenticated permission probe confirms that the
  // backend has enabled repair; the backend still requires a fresh
  // short-lived pairing code and administrator approval.
  bool repairPermission = false;
  if ((g_cfg.auth_state == "auth_invalid" || g_cfg.auth_state == "revoked")
      && pairingRetryDue(g_cfg)) {
    repairPermission = checkRepairPermission(g_cfg);
    if (!repairPermission) {
      goDeepSleepSeconds(pairingBackoffSeconds(g_cfg));
      return;
    }
  }
  if ((automaticPairingAllowed(g_cfg) || repairPermission) && !performAutomaticPairing(g_cfg)) {
    if (lastDeviceErrorCode.length() == 0U) {
      lastDeviceErrorCode = "DEVICE-PAIRING-RECOVERY";
      lastDeviceErrorMessage = "自動配對尚未完成；本輪停止網路工作並等待 bounded recovery wake";
    }
    goDeepSleepSeconds(pairingBackoffSeconds(g_cfg));
    return;
  }
  if (g_cfg.auth_state != "paired" || !hasDeviceCredential(g_cfg)) {
    lastDeviceErrorCode = "DEVICE-AUTH-CONFIG";
    lastDeviceErrorMessage = "配對尚未完成；不進入未授權的下載或狀態回報流程";
    goDeepSleepSeconds(pairingBackoffSeconds(g_cfg));
    return;
  }

#if INKTIME_PHOTOPAINTER_ENABLED
  photoPainter.refreshPowerState();
  if (!photoPainter.powerSourceKnown() && !photoPainter.usbConnected()) {
    // Unknown PMIC/battery identity is not permission to enter the AP portal
    // or perform a full-refresh wake.  Keep the recovery bounded until a
    // supported board/power source is identified.
    lastDeviceErrorCode = "DEVICE-POWER-UNKNOWN";
    lastDeviceErrorMessage = "PMIC／電池來源未知，已停止網路刷新並等待 bounded recovery wake";
    goDeepSleepSeconds(300U);
    return;
  }
#endif

  struct tm timeinfo;
  String wakeOrigin;
  (void)ensureWakeHttpSession(g_cfg, wakeOrigin);
  bool hasTime = syncTime(g_cfg, timeinfo);

