steven87090799/InkTime/esp32/ink-display-7C-photo/ink-display-7C-photo.ino
  bool ok = downloadDailyPhotoBin(g_cfg);
  if (serverConfigChanged) hasTime = syncTime(g_cfg, timeinfo);
  bool displayUpdated = false;
  if (ok) {
    if (currentPrefetchOnly) {
      displayUpdated = false;
      (void)flushRamQueueAckBatch(g_cfg);
    } else {
    bool mayDisplay = true;
    if (currentDisplaySkipped) {
      saveDisplayRecord(g_cfg, true);
      if (currentFromQueue) {
        mayDisplay = sendQueueEvent(g_cfg, inktime::QueueEvent::DisplayCompleted, true);
      }
    } else if (currentFromQueue) {
      mayDisplay = sendQueueEvent(g_cfg, inktime::QueueEvent::DisplayStarted);
    }
    if (mayDisplay && currentFromQueue) {
      // Download/hash events and DISPLAY_STARTED are RAM-first, but all
      // required ACK work must be attempted before radio shutdown.
      mayDisplay = flushRamQueueAckBatch(g_cfg);
    }
    if (!mayDisplay && currentFromQueue && queueAckPermanentReject) {
      // A stable server-side rejection is durable evidence that retrying this
      // ACK cannot repair the response in the current wake. It must not
      // prevent a verified frame from being displayed; the terminal event is
      // retained for the next delayed-terminal recovery.
      mayDisplay = true;
    }
    if (!mayDisplay && currentFromQueue && !currentDisplaySkipped) {
      const String ackFailure = lastDeviceErrorCode.length() > 0U
        ? lastDeviceErrorCode : String("DEVICE-QUEUE-ACK");
      sendQueueEvent(g_cfg, inktime::QueueEvent::DisplayFailed, false, ackFailure);
    }
    if (mayDisplay && !currentDisplaySkipped) {
      stopNetworkBeforeDisplay();
      initDisplay(g_cfg);
      displayUpdated = drawFromFrameData(g_cfg);
    }
    if (displayUpdated) {
      saveDisplayRecord(g_cfg, true);
      if (currentFromQueue) {
        sendQueueEvent(g_cfg, inktime::QueueEvent::DisplayCompleted);
      }
    } else if (!currentDisplaySkipped && mayDisplay) {
#if INKTIME_PHOTOPAINTER_ENABLED
      lastDeviceErrorCode = photoPainter.lastError();
#else
      lastDeviceErrorCode = "DEVICE-DISPLAY";
#endif
      lastDeviceErrorMessage = "電子紙刷新失敗或逾時";
      saveDisplayRecord(g_cfg, false);
      if (currentFromQueue) {
        sendQueueEvent(g_cfg, inktime::QueueEvent::DisplayFailed, false, lastDeviceErrorCode);
      }
    }
  }
#if INKTIME_PHOTOPAINTER_ENABLED
  if (ok && !offlineScheduleTxnBlocked && !currentPrefetchOnly
      && g_cfg.delivery_mode == "inktime_offline_schedule"
      && (displayUpdated || currentDisplaySkipped)) {
    clearOfflineRetryState();
  }
#endif
  } else {
#if DEBUG_LOG
    DBG_PRINTLN("[BOOT] downloadDailyPhotoBin FAILED");
#endif
  }
  if (deviceAuthInvalid) {
    // A confirmed 401/403 stops this wake completely.  Do not send a
    // follow-up Status or retry Queue/image work with the rejected credential.
    goDeepSleepSeconds(60U);
    return;
  }
  if (!networkClosedForDisplay) reportDeviceStatus(g_cfg, displayUpdated);

#if INKTIME_PHOTOPAINTER_ENABLED
  if (runUsbServiceMode()) {
    // The prior timestamp may be hours old after a USB service session.
    hasTime = getLocalTime(&timeinfo, 1000);
  }
#endif

  if (!hasTime) {
    struct tm tmp;
    if (!networkClosedForDisplay && syncTime(g_cfg, tmp)) {
      sleepUntilNextSchedule(g_cfg, true, tmp);
    }
    else                      sleepUntilNextSchedule(g_cfg, false, timeinfo);
  } else {
    sleepUntilNextSchedule(g_cfg, true, timeinfo);
  }
}

void loop() {
}
